[
  {
    "ID": 1,
    "note": "1. Continue moderate intensity exercise two days a week, one hour each. 2. Adhere to MyHealthy Plate at least once a week and cook at home on weekends. Client attended the 3-month follow-up last week and reported improvements in cholesterol, blood glucose, and blood pressure. Client was newly prescribed an additional diabetes medication to better control blood glucose. Goals Review: 1. Increase the intensity and frequency of exercises to twice a week. (100% success) client started with 10 minutes of walking, followed by jogging for 40 minutes with 200m sprints, and ended with walking. Client was encouraged to assess intensity using the Talk and Sing method. 2. Adhere to MyHealthy Plate at least once a week and cook at home on weekends. (100% success). Client cooked brown rice, steamed fish, and vegetables. The benefits of brown rice (glycaemic index), white meats, and fibres were discussed. The MyHealthy Plate framework was also explained. Goals Setting: 1. Continue moderate intensity exercise two days a week, one hour each. (Confidence level: 9/10) 2. Adhere to MyHealthy Plate at least once a week and cook at home on weekends. (Confidence level: 7/10) Client shared plans to travel in November and December and was advised to continue applying the MyHealthy Plate principles while overseas. Other lifestyle medicine pillar: Sleep – client currently sleeps 6 to 7 hours every day.",
    "number_of_goals": 2,
    "goals": [
      "Continue moderate intensity exercise two days a week, one hour each. (Confidence level: 9/10)",
      "Adhere to MyHealthy Plate at least once a week and cook at home on weekends. (Confidence level: 7/10)"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 2,
    "note": "Goals Review: 1. Take medications in the morning for seven days a week. (100% success) 2. Jog for at least 30 minutes, once a week. (75% success, completed for three weeks) 3. Have homecooked dinner with family at least once a week, every Sunday, opting for fish over red meats. (50% success, completed for two weeks) WeeklyFGoals: 1. Increase the duration of jogging to 45 minutes, once per week, every Saturday. (Confidence: 75%) 2. Homecook dinner on the weekend, once per week, for the next four weeks. (Confidence: 75%) 3. Continue to take statin medications seven days a week. (Confidence: 100%) App Usage: client agreed to watch the nutrition video (5.2) and discuss it at the next coaching session. Other Points: Discussed strategies to increase total physical activity to meet the recommended 150 minutes per week. client agreed to build activity into daily routines by alighting two bus stops earlier and walking home, and by using the stairs up to level 9 instead of taking the lift.",
    "number_of_goals": 3,
    "goals": [
      "Increase the duration of jogging to 45 minutes, once per week, every Saturday. (Confidence: 75%)",
      "Homecook dinner on the weekend, once per week, for the next four weeks. (Confidence: 75%)",
      "take statin medications seven days a week. (Confidence: 100%)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 3,
    "note": "Wellness vision: client hopes to reduce medication dosage within the next 12 months. Reasons include a desire not to stay on long-term prescriptions and concerns about the cost of certain medications.\r\nMedical history: client is 52 years old and currently managing asthma and joint inflammation.clientis on six medications in total, including a recent adjustment in dosage made during a routine check-up.\r\nGoals discussion: client is motivated to improve their health through sustainable lifestyle changes with the hope of tapering medication in the future. Client has been consistent with morning medication intake and feels confident continuing this routine.clientaims to jog once a week to improve cardiovascular health and stamina. As part of dietary improvements,clientplans to cook more often at home, choosing lighter options like fish instead of red meats for Sunday family dinners. These steps are part of a broader effort to reassess their health status and medication needs after one year.\r\nWeekly SMART Goals: 1. Take statin medications in the morning for seven days a week. 2. Jog for at least 30 minutes, once a week. 3. Have a homecooked dinner with family at least once a week, every Sunday, opting for fish over red meats.",
    "number_of_goals": 3,
    "goals": [
      "Take statin medications in the morning for seven days a week",
      "Jog for at least 30 minutes, once a week",
      "Have a homecooked dinner with family at least once a week, every Sunday, opting for fish over red meats"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 4,
    "note": "(1) Diet: Take a photo of meals and document it on the app daily. (2) Medication: Track medication use on the app and aim to take it every day with zero missed doses. (3) Meditation: Meditate during daily walks by listening to music or meditation clips from the CADENCE DPHA app. (4) Health Journal: Enter 1 to 2 journal entries before the next session.\r\n3-month goals remain unchanged: (1) Reduce consumption of indulgent foods such as durian, pork leg, kway chap, and beer. (2) Experience satisfaction from eating healthily. (3) Consistently take prescribed medications (metformin and statin). (4) Incorporate meditation into daily routine.\r\nMedication: Occasionally misses evening doses of statins and metformin due to work and a busy schedule. After reviewing educational content, recognizes the importance of daily medication adherence. Understands that medications may need to be continued long-term but is committed to improving overall heart health through lifestyle changes.\r\nFood: Eats healthily on weekdays and cooks for family on weekends. Reflected on how food fosters social connection and shared that this sense of bonding is meaningful. Uses healthier cooking methods such as air-frying, reducing salt, and using condiments creatively to enhance flavor without MSG.\r\nExercise and meditation: Walks daily and has begun treating this time as a space for mindfulness. Takes the stairs around the estate to strengthen muscles for hiking and observes the environment, including how neighbors decorate their spaces. This habit layering supports both physical and mental well-being.\r\nWork: Plans to gradually reduce part-time consultancy workload to create more space for health.\r\nHealth journal: Writing is not a preferred activity, especially during busy periods, but willing to give it a try.\r\nOther: Recently returned from a family trip to Cebu and has plans to travel to Thailand next week. Also hopes to visit Jeju next year. Despite a busy schedule, concluded the session by stating that “there are no excuses, and being busy is not an excuse,” and affirmed a clear intention to prioritize health.",
    "number_of_goals": 4,
    "goals": [
      "Take a photo of meals and document it on the app daily",
      "Track medication use on the app and aim to take it every day with zero missed doses",
      "Meditate during daily walks by listening to music or meditation clips from the CADENCE DPHA app",
      "Enter 1 to 2 journal entries before the next session"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 5,
    "note": "(1) Diet: Take a photo of meals and document it on the app daily. (2) Medication: Track medication use on the app and take medication daily, aiming for zero missed doses. (3) Meditation: Meditate once a week before sleep using clips from the CADENCE DPHA app. 3-month goals remain the same, with the addition of a new meditation goal: (1) Reduce consumption of indulgent foods such as durian, pork leg, kway chap, and beer. (2) Experience satisfaction from eating healthily. (3) Consistently take prescribed medications. (4) Incorporate meditation into routine. Food: client has been finding it easier to maintain healthy eating habits. However, upcoming travel with family and several group gatherings may pose some challenges. Medication: client has been mostly consistent with medication intake, missing only two or three doses this month due to irregular mealtimes. Exercise: client walks daily and engages in gentle weekend movement routines. Previously engaged in water-based activity but stopped during the pandemic. Open to revisiting this in the future. Meditation: client is not fully ready to adopt meditation as a habit but expressed interest in trying it as a replacement for alcohol. Currently in the preparation phase of habit change. Work: client has had a busy work schedule recently. Gratitude journal: Discussed the benefits of reflective writing. client was introduced to weekly prompts and expressed willingness to explore them for personal benefit.",
    "number_of_goals": 3,
    "goals": [
      "Take a photo of meals and document it on the app daily",
      "Track medication use on the app and take medication daily, aiming for zero missed doses",
      "Meditate once a week before sleep using clips from the CADENCE DPHA app"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 6,
    "note": "(1) Diet: Take a photo of meals and document it on the app daily. (2) Medication: Track medication use on the app and take medication every day, aiming for zero missed doses. Food: Since hosting a family event in June, client’s schedule has become more stable, allowing for greater control over food intake. Currently takes two meals a day and prepares homemade granola or bread. Breakfast is often shared with family. Although meals are not logged on the app, client feels confident that the diet is healthy. The inability to backdate entries has been noted as a limitation to consistent app use. Meditation: client does not currently feel the need for meditation. A personal routine of watching videos or television before sleep has helped with relaxation and maintaining good sleep quality. Medication: After viewing videos on the app, client has gained a better understanding of medications and expressed motivation to be consistent. Medication intake has been regular, with only two missed doses this month. client aims to achieve full adherence by the next session. Job satisfaction: client is considering leaving a full-time position due to organizational challenges. The decision is difficult because of strong commitment to clients and financial considerations. Exercise: client has been walking briskly for two hours daily. Generative moment: client reflected on a period of improved health when regularly engaging in cycling. Recalled this as a time when medication levels, including metformin, were reduced. Expressed interest in returning to that activity after leaving current job. Action items: (1) Follow up on reinstating the ability to backdate food and medication diary entries in the app. (2) Send weekly gratitude journal exercises.",
    "number_of_goals": 2,
    "goals": [
      "Take a photo of meals and document it on the app daily",
      "Track medication use on the app and take medication every day, aiming for zero missed doses"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 7,
    "note": "(1) Diet: Take a photo of meals and document it on the app daily. (2) Medication: Track medication use on the app. Wellness vision: client wants to remain healthy and mobile in order to witness their child and grandchildren grow up and share meaningful life moments with them. 3-month goals: (1) Reduce consumption of indulgent foods such as durian, pork leg, kway chap, and beer. (2) Experience satisfaction from eating healthily. (3) Consistently take prescribed medications. client information: client is in their early 60s, with a birthday approaching soon. Although retired in 2020, currently works full-time in consultancy and part-time in teaching. Lives with spouse; son recently got married. Occasionally consumes alcohol to aid with sleep. Family history includes a parent who had multiple strokes. Reason for joining study: Finds value in contributing to science. Strengths: Demonstrates strong discipline—successfully lost weight after diagnosis. Maintains a physically active lifestyle, regularly achieving 15,000 to 20,000 steps a day, and engages in outdoor and wellness activities. Barriers: Struggles to maintain a healthy diet when socialising with friends. Life events, such as the recent family celebration, led to less healthy eating patterns. An irregular work schedule makes medication adherence more challenging. Future areas to explore: client enjoys personal challenges and could be supported with goal-setting that leverages this trait. Has identified work stress as a limiting factor in sustaining a healthy lifestyle.",
    "number_of_goals": 2,
    "goals": [
      "Take a photo of meals and document it on the app daily",
      "Track medication use on the app"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 8,
    "note": "Smart Goal: Follow MyHealthy plate three times a week. Wellness vision: To be healthy and able to walk in nature. Three-month goals: To reduce LDL cholesterol levels through a healthy diet and regular exercise.",
    "number_of_goals": 1,
    "goals": [
      "Follow MyHealthy plate three times a week"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 9,
    "note": "2. Tick the medication log for statin every day after consumption. Instructions on how to add statins were sent to the client.",
    "number_of_goals": 1,
    "goals": [
      "Tick the medication log for statin every day after consumption"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 10,
    "note": "(1) Exercise: Increase the frequency of walking from three times a week to five times a week. (2) Diet: Reduce portion sizes when trying new foods while travelling by ordering one portion and sharing with family. Wellness vision: To stay independent, enjoy travel, and live without chronic illness while doing activities that bring joy. 3-month goal: Reduce weight to a more attainable range between 64 and 66kg. Client is in their mid-50s and joined the programme to focus on personal health. Lives with spouse and has two adult children. The family travels together every few months. Currently works from home and is considering retirement soon. Previously led a sedentary lifestyle and recently began walking more regularly for health reasons. Walks were typically three to four times a week, not intense, and often around the home area. Health background includes high blood pressure and high cholesterol. No diabetes, though there is a family history. Currently takes statin medication in the evening and does not take supplements. Client enjoys exploring new foods during travels, which is believed to have contributed to weight gain. On non-travel days, meals are home-cooked using grilling and steaming. Weight has reduced from 80kg to 70kg, primarily due to intermittent fasting and walking. While the recommended target is 64kg, client feels 66kg may be more realistic due to having been on the heavier side growing up. Client is highly motivated to lose weight and prevent chronic illness from worsening. Future sessions may explore other areas of personal interest. Action item: Share national physical activity guidelines to support exercise planning.",
    "number_of_goals": 2,
    "goals": [
      "Increase the frequency of walking from three times a week to five times a week",
      "Reduce portion sizes when trying new foods while travelling by ordering one portion and sharing with family"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 11,
    "note": "(1) Diet: Consume oatmeal with additional nuts for lunch three times a week (Confidence 8/10). (2) Weight: Jog with my spouse every weekend, adding two laps each time. Wellness vision: To live without illness, maintain good mental health, and have financial stability to continue working, carry out daily activities, travel, and stay mobile. 3-month goals: (1) Continue being physically active through jogging. (2) Lose weight together with spouse. Energy level has been lower recently, likely due to returning from a long overseas trip. A highlight from that trip involved the family rushing to catch a ferry—while others were out of breath, client felt relatively strong, attributing this to maintaining a regular exercise routine. Goal review: Rated progress as 4/10. Meals at home continued to include oil due to family cooking habits, but client made healthier choices when eating out by bringing alternatives or selecting low-oil dishes. App usage: Explored the app but found videos lengthy and questionnaires overwhelming, which led to disengagement. Asked whether app use was mandatory. The health coach reassured client that the app is a supportive tool but not compulsory and explained how it can add value. Generative moment: When reflecting on the app content, client noted difficulty letting go of longstanding diet beliefs. Shared a conversation with a workplace dietitian, who highlighted low protein intake and recommended tofu and eggs. Also became aware that the bread commonly eaten was highly processed. Although yogurt was suggested, client’s workplace lacks fridge access. Based on the dietitian’s advice, oats were suggested as an alternative and client agreed to try it. Insights: Strong internal drive to follow through on commitments, especially when supported with structure. Feedback: Finds the current pace of sessions to be suitable and sustainable.",
    "number_of_goals": 2,
    "goals": [
      "Consume oatmeal with additional nuts for lunch three times a week (Confidence 8/10)",
      "Jog with my spouse every weekend, adding two laps each time"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 12,
    "note": "(1) Take statin medications daily at 10am on weekdays and with meals on weekends (confidence level: 9/10). (2) Diet: Find a balance between food experimentation and healthy eating by inviting others to try dishes while testing recipes. (3) Use the food diary feature to log meals (confidence 7/10). Wellness vision: Described feeling tired but fulfilled, with supportive relationships and a few pets at home. 3-month goals: (1) Reduce cholesterol levels from approximately 4 to around 3. (2) Reduce weight from around 80kg to 75kg. Energy level was high during the session, likely due to having eaten and slept well. A recent highlight was spending two weeks at home gaming and adjusting sleep, which gave time to focus on preparing simple, healthy meals. 3-month goal review: Client reported a 3kg weight loss since the last session. Goal review 1: Medication adherence was rated 8/10. Most doses were taken as scheduled, with two missed entries attributed to forgetting to log them in the app. Goal review 2: Diet adherence rated 7/10. No fast food was consumed in the past month. Client identified social situations as a trigger for unhealthy choices but shared strategies such as hosting meals at home or skipping outings. Noted that ice cream and desserts shared with a partner were small in portion and framed as meaningful time together. Identified a pattern of either staying on track or slipping entirely, and recognised the importance of breaking that cycle early. Goal review 3/app usage: Tried watching app videos but did not find them engaging. Generative moment: Shared a regular gym routine that includes strength and cardiovascular training 4 to 5 times per week. Monitors exercise intensity through physical cues and has maintained this practice over time. Health coach discussed whether this meets the recommended 150 minutes of moderate activity per week. Life phase: Anticipates increased food intake due to recipe testing, particularly with high-fat cuisines. Discussed the importance of setting structures to balance experimentation with health goals. Strengths: Highly disciplined, aware of familial cholesterol risk, and motivated to make sustainable health-related changes. Action item: Continue discussing ways to maintain a healthy balance while developing culinary skills.",
    "number_of_goals": 3,
    "goals": [
      "Take statin medications daily at 10am on weekdays and with meals on weekends (confidence level: 9/10)",
      "Find a balance between food experimentation and healthy eating by inviting others to try dishes while testing recipes",
      "Use the food diary feature to log meals (confidence 7/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 13,
    "note": "(1) Take medications daily at 10am on weekdays and with meals on weekends. (2) Avoid giving in to food temptations such as fast food by being mindful of cues and recognising situations that challenge healthy choices. (3) Explore the app and identify a feature that could be used regularly. Wellness vision: Described feeling tired from pursuing passions but overall content with life. Maintains close relationships and lives with a few pets. 3-month goals: (1) Reduce cholesterol from around 4 to 3. (2) Reduce weight from around 80kg to 75kg. Reasons for joining: Despite efforts to manage diet and exercise, cholesterol levels have remained high. Background: Client is in their late 30s, originally from East Asia, with a strong passion for culinary arts and gaming. Open to health coaching with a conversational and playful tone. Medical history: Diagnosed with high cholesterol two years ago. Lifestyle: Work routine is mostly sedentary, but client engages in strength-focused gym training five times per week. Different muscle groups are targeted during each session. Occasionally watches fitness videos to refine technique and has considered trying out short home mobility routines for recovery. Diet: Enjoys cooking and includes vegetables such as broccoli and bean sprouts in meals. Recently experimented with baking low-sugar granola bars. Manages sugar intake well most of the time but finds it difficult to resist sugary snacks and drinks when socialising with friends. Noted that bubble tea tends to be a common treat during these gatherings. Medication: Has recently started taking medication more consistently. Keeps medication both at work and at home. Expressed the importance of making it a habit and agreed to link medication with food intake as a strategy to increase consistency. Shared the idea of setting alarms with quirky game-related names to stay engaged with the routine. Strengths: Aware of health condition and demonstrates strong motivation to make changes. Maintains a positive and optimistic mindset. Barriers: Described a tendency to slip into unhealthy eating for several days once fried or “bad” foods are reintroduced. Notices that stress or boredom can also be triggers. Future areas of interest: Explore dietary patterns and emotional relationship with food in more depth. Understand physical activity routines better and enquire about other aspects of health such as substance use. Also expressed curiosity about how chefs manage nutrition in a demanding kitchen environment.",
    "number_of_goals": 3,
    "goals": [
      "Take medications daily at 10am on weekdays and with meals on weekends",
      "Avoid giving in to food temptations such as fast food by being mindful of cues and recognising situations that challenge healthy choices",
      "Explore the app and identify a feature that could be used regularly"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 14,
    "note": "Second SMART Goal: Do 10 minutes of meditation every day to relax and manage stress. The health coach explained the meditation features available in the CADENCE D-PHA app.",
    "number_of_goals": 1,
    "goals": [
      "Do 10 minutes of meditation every day to relax and manage stress"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 15,
    "note": "1. Eat a healthy dinner three to four times a week, focusing on meals with plenty of vegetables. Client has already made good progress by choosing healthier, non-fried options. Shared a history of digestive issues and a previous finding of multiple polyps, which has increased motivation to maintain dietary changes.",
    "number_of_goals": 1,
    "goals": [
      "Eat a healthy dinner three to four times a week, focusing on meals with plenty of vegetables"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 16,
    "note": "2. SMART Goal: Follow MyHealthy Plate for lunch every weekday, from Monday to Friday. Client shared a willingness to eat at the hawker centre and replace less healthy options with alternatives such as fish soup. Plans to follow this routine consistently during lunchtime, with progress to be reviewed at a future session.",
    "number_of_goals": 1,
    "goals": [
      "Follow MyHealthy Plate for lunch every weekday, from Monday to Friday"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 17,
    "note": "2. Second SMART Goal: Follow My Healthy plate, such as fish soup and mixed vegetables, for lunch four days a week. Client will try to eat healthier overall. The three-month goal is to lose a few kilograms.",
    "number_of_goals": 1,
    "goals": [
      "Follow My Healthy plate, such as fish soup and mixed vegetables, for lunch four days a week"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 18,
    "note": "2. Walk for 30 minutes alone every Tuesday at 8:30, and for 45 minutes with a family member every Sunday. Client will try to incorporate walking as part of an exercise routine. Shared that time is limited due to work as a driver and having to manage most responsibilities independently without consistent support at home.",
    "number_of_goals": 1,
    "goals": [
      "Walk for 30 minutes alone every Tuesday at 8:30, and for 45 minutes with a family member every Sunday"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 19,
    "note": "(1) Diet: Reduce red meats intake and choose other protein sources such as fish and eggs, along with increasing vegetable intake by 50%, two days a week (80% confident). Wellness vision: To stay physically active and maintain a positive mindset in order to enjoy meaningful activities like walking and playing games. Being healthy is also important for supporting loved ones and spending quality time with friends.\r\n3-month goals: (1) Prevent the onset of osteoporosis. (2) Protect and preserve knee health. (3) Work towards gradual weight loss.\r\nEnergy level: Moderate. Client began the session by discussing ongoing feelings of hunger, which they believe are linked to their current medication routine. This hunger has led to weight gain and difficulty managing intake.\r\nMedication: Client repeatedly sought reassurance and shared concerns about current medication side effects, including persistent hunger that interferes with sleep, increased consumption of rice, noodles, and porridge, as well as headaches that limit daily functioning.\r\nGoal review 1 (Diet): Reported significant success in reducing intake of roti prata. Had it only once in the past month, attributing success to avoiding certain shops, skipping breakfast, or opting for alternatives like toast and eggs.\r\nGoal review 2 (Knee care): Client rated knee massage practice as 8/10. This is done once a week and is perceived as helpful. Typically performed when remembered.\r\nGoal review 3 (App usage): Client explored app content but found the information basic and already familiar. Searches for medical information independently online, recently focusing on medication side effects and drug interactions. Found the app’s food diary less useful compared to others that offer detailed nutrition breakdowns or calorie tracking.\r\nGenerative moment: Discussed hunger management and the types of foods consumed—such as porridge, noodles, and milk—which may not be very filling. Explored more satiating alternatives, though client shared that such options are not easily available in nearby food courts, indicating limited readiness for dietary change.\r\nMedication discussion: Client expressed a strong desire to stop current medication due to side effects. Explored options including trial breaks, returning to a previous medication routine, and consulting a pharmacist or physician for guidance.\r\nFuture areas of interest: Weight management and sustainable dietary strategies.\r\nAction item: Follow up on medication-related symptoms and explore diet planning in more detail.",
    "number_of_goals": 1,
    "goals": [
      "Reduce red meats intake and choose other protein sources such as fish and eggs, along with increasing vegetable intake by 50%, two days a week (80% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 20,
    "note": "(1) Massage the knee and apply heat once a week. (2) Ongoing: Replace roti prata with healthier alternatives such as oatmeals for breakfast, three days a week (90% confident). (3) Explore the app and identify one feature that could be used regularly.\r\nClient is in their early 70s and leads a highly active lifestyle. Works on weekdays from late morning to evening at a construction firm in a supervisory role, mentoring younger colleagues as part of a gradual handover before retirement. Has been with the organisation for over three decades and is preparing to step back at the end of the year. On weekends, supports a small family-run business and occasionally helps with product development and operations. In free time, enjoys playing mobile strategy games and watching videos.\r\nHas caregiving experience and is currently supporting a household member recovering from a recent surgery.\r\nHealth background includes high cholesterol, with a belief that this is partly influenced by family history. Noted that cholesterol levels were lowest during a period of reduced eating and stress. Also has a history of cancer and is proud of overcoming significant health challenges, including surviving a major infectious disease outbreak.\r\nMental health: Previously sought psychiatric support but now feels stable and mentally well.\r\nSleep routine: Usually sleeps around 1am and wakes between 7–8am. Avoids sleeping too early to prevent disrupted sleep cycles. Averages about 6 to 7 hours of sleep per night.\r\nApp usage: Has been actively using the app since onboarding.\r\nCurrent goals are to prevent osteoporosis and preserve knee health due to frequent stair climbing at work.\r\nStrengths: Highly resilient, maintains a positive mindset, and brings energy and humour into conversations.\r\nFuture areas of interest: Explore aspects of current routines that are already effective and identify any new habits that may help achieve long-term health goals.",
    "number_of_goals": 3,
    "goals": [
      "Massage the knee and apply heat once a week",
      "Replace roti prata with healthier alternatives such as oatmeals for breakfast, three days a week (90% confident)",
      "Explore the app and identify one feature that could be used regularly"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 21,
    "note": "(1) Diet: Prepare balanced and simple home-cooked meals for self and household at least two times a week (8/10). (2) Exercise: Follow the exercise shown in exercise videos three days a week. (3) App features: Use food diary at least once a day, 7 days a week (7/10).\r\nWellness vision: To stay healthy, avoid falling sick easily, remain positive, and maintain a healthy diet. Client wants to be in good health to witness and support their child’s growth and achievements.\r\n3-month goals: (1) Engage in more regular exercise. (2) Reduce weight from around 70kg to 60kg to lower BMI.\r\nEnergy level: High at the time of session, as it was conducted in the morning.\r\nHighlight of the week/month: Nothing significant; general routine maintained.\r\nGoal review 1 (Diet): Rated a 7/10. Client prepared more home-cooked meals due to the fasting period, but occasionally ordered food from outside. When cooking, meals included rice, pasta, vegetables, and proteins. Health coach used this opportunity to explain the My Healthy Plate model.\r\nGoal review 2 (App usage): Rated 4/10. Limited engagement due to a busy schedule. Shared that meals were usually eaten before remembering to log them in the food diary. Health coach encouraged post-meal logging and explained the purpose of tracking food intake.\r\nGoal review 3 (Exercise): Recently began using online exercise videos and has been doing home-based movement routines for 30 to 45 minutes, twice a week. Started the previous week and reported feeling refreshed after each session.\r\n3-month goal review 1: Client has started exercising consistently and will continue with the current goal.\r\n3-month goal review 2: Reported a 4kg weight loss, attributed to fasting, and is motivated to continue working toward the weight goal.\r\nFuture areas of interest: Interested in learning more about balanced nutrition, the My Healthy Plate framework, and maintaining a consistent diet and exercise routine.\r\nAction item: Share nutrition and exercise videos through the CMS for client reference.",
    "number_of_goals": 3,
    "goals": [
      "Prepare balanced and simple home-cooked meals for self and household at least two times a week (8/10)",
      "Follow the exercise shown in exercise videos three days a week",
      "Use food diary at least once a day, 7 days a week (7/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 22,
    "note": "(1) Diet: Prepare balanced and simple home-cooked meals for the household at least one to two times a week (6-7 out of 10 confidence). (2) Exercise: Do the exercises shown in educational videos at least two days a week (confidence level 4 out of 10). (3) App features: Use food diary daily (confidence level 4 out of 10). Wellness vision: To avoid falling sick easily, stay positive, and maintain a healthy diet. Staying healthy is important to support and witness a child’s growth and success. 3-month goals: (1) Increase physical activity. (2) Reduce weight from around 70kg to 60kg to lower BMI. Client attended the session despite experiencing symptoms of illness, including a runny nose and cough. The health coach acknowledged and appreciated the continued commitment to health. Diet: Client shared detailed reflections on incorporating healthy foods like vegetables into meals and reducing intake of snacks such as chocolates and chips. Demonstrated strong awareness of food choices and reported a 60–70% success rate in maintaining a healthy diet. Shared that overeating often happens in social settings or during buffets. Diet appears to be an area of personal interest, prompting a deeper discussion about strategies for healthy eating during the fasting month. One ongoing goal is to cook at home more often to better control ingredients and include more fruits and vegetables. Currently cooks for a household of four and faces no major challenges preparing healthy meals. One barrier noted was the need for grocery shopping, but plans to simplify recipes to reduce the burden. Confidence in maintaining this habit was rated at 6–7 out of 10. Medication: Reported full adherence to medication, taking all doses in the morning, making it easy to maintain consistency. Exercise: Has not yet begun exercising but has been watching exercise videos while lying down. After discussing potential barriers, the health coach suggested watching in a seated position to make transitioning to physical activity easier. Confidence level for starting was rated at 4 out of 10. App usage: Limited time to use the app. The health coach encouraged further exploration of app features and demonstrated how to use the food diary. Client expressed intent to try the diary feature in the coming month, with confidence level rated at 4 out of 10.",
    "number_of_goals": 3,
    "goals": [
      "Prepare balanced and simple home-cooked meals for the household at least one to two times a week (6-7 out of 10 confidence)",
      "Do the exercises shown in educational videos at least two days a week (confidence level 4 out of 10)",
      "Use food diary daily (confidence level 4 out of 10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 23,
    "note": "(1) Diet: Adopt strategies for healthy home cooking such as using sunflower or sesame oil and increasing vegetable intake (confidence 7/10). (2) Exercise: Use exercise machines for muscle strengthening on weekends for 30 minutes, either alone or with company (confidence 6/10). (3) Walk for at least 10,000 steps a day, 7 days a week (confidence 8/10). Wellness vision: To relax and enjoy nature, maintain spiritual practices, travel, and spend time with family.\r\n3-month goals: (1) Maintain weight around 76kg. (2) Reduce cholesterol. (3) Maintain a healthy lifestyle to support long-term wellbeing.\r\nEnergy level was around 80%, though sleep was limited due to attending the appointment.\r\nGoal review 1 (Diet): Reduced food intake by about 70%. Shared examples of portion control, such as choosing five rice cakes instead of seven. (confidence 7/10)\r\nGoal review 2 (Exercise): Walking 10,000 steps daily has been maintained, supported by a physically active work routine. Other forms of exercise are more difficult to sustain due to irregular work hours.\r\nGoal review 3 (Medication): Keeps medication accessible and takes it with meals. Occasionally misses doses during night shifts when meals are skipped, but overall views medication as a priority in managing health.\r\nGenerative moment (Sleep): Discussed the impact of sleep on mood, concentration, and physical comfort. Typically gets 7–8 hours during day shifts and around 6 hours during night shifts. Sleep drops to 3–4 hours during disruptions like appointments or renovations. Explored sleep hygiene strategies including ear plugs, curtains, and creating a quiet environment with household support. \r\n3-month goal reviews: (1) Maintain 76kg – continue. (2) Reduce cholesterol – recent results showed improvement; continue with reduced intake of oily food. (3) Maintain a sustainable diet and lifestyle routine – continue.\r\nGoal setting 1 (Diet): Revisited strategies for healthy home cooking such as using sunflower or sesame oil and increasing vegetable intake. When eating out, aim for reduced or no sugar options. Confidence rated 7/10 due to an upcoming family trip where there may be temptations, but feels supported to make healthier choices.\r\nGoal setting 2 (Exercise): Use exercise machines at home when rested.\r\nStrengths: Disciplined and consistent in following through with personal goals.",
    "number_of_goals": 3,
    "goals": [
      "Adopt strategies for healthy home cooking such as using sunflower or sesame oil and increasing vegetable intake (confidence 7/10)",
      "Use exercise machines for muscle strengthening on weekends for 30 minutes, either alone or with company (confidence 6/10)",
      "Walk for at least 10,000 steps a day, 7 days a week (confidence 8/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 24,
    "note": "(1) Exercise: Switch from casual walking to brisk walking, maintaining a daily goal of 10,000 steps (confidence 7/10). (2) Diet: Reduce the overall quantity of food consumed by 25%, confidence 7/10. Medication intake: Has difficulty remembering to take afternoon doses during certain days; this will be followed up in the next session.\r\nWellness vision: To relax and enjoy nature, maintain spiritual practices, travel, and spend quality time with loved ones.\r\n3-month goals: (1) Maintain weight around 76kg. (2) Reduce cholesterol. (3) Reduce blood sugar.\r\nClient joined the programme with a focus on improving health. Currently living with high cholesterol and type 2 diabetes. Believes medication is helpful and reports no side effects, though struggles with adherence to evening doses on certain days. Medication reminders were recommended but client was hesitant to use the app features.\r\nDiet: Eats mostly home-cooked food. Red meat is rare, with fish and carbohydrates forming the bulk of meals. Takes coffee and tea without sugar. Recently lost approximately 7–8kg during a trip overseas, attributing it to reduced food intake and increased physical activity while caregiving for a family member.\r\nExercise: Walks at least 10,000 steps daily, tracked with an activity device.\r\nFamily: Main source of support. Lives with family members who are now financially independent, allowing greater focus on health. Shared that the family occasionally travels together for rest and recreation.\r\nApp usage: Client was introduced to features like educational videos, medication reminders, and messaging. Expressed willingness to try them when time permits.\r\nStrengths: Recently experienced positive weight changes and dietary improvements, particularly while overseas. Maintains daily walking goals and appears ready to prioritise health now that personal responsibilities have shifted.\r\nBarriers: Irregular daily routine remains a key challenge, particularly for medication adherence and sleep consistency.\r\nFuture areas of interest: Continue supporting improvements in diet and physical activity. Future sessions may explore strategies to support consistent medication intake and improving sleep quantity.",
    "number_of_goals": 2,
    "goals": [
      "Switch from casual walking to brisk walking, maintaining a daily goal of 10,000 steps (confidence 7/10)",
      "Reduce the overall quantity of food consumed by 25%, confidence 7/10"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 25,
    "note": "1. Check-in with the first SMART goal: Client has been working on eating a healthy plate for lunch five times a week. Progress will be reviewed to see how consistent this has been and whether any adjustments are needed.\r\n2. Weekly goal check-in: Assessing adherence to short-term goals set in the previous session, identifying what has worked well and any challenges faced.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 26,
    "note": "1. Take statins every night and log it into the app. Client has familial hypercholesterolaemia and has been consistent with statin intake.",
    "number_of_goals": 1,
    "goals": [
      "Take statins every night and log it into the app"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 27,
    "note": "(1) Support emotional wellbeing at home by bringing mother out for physical activity three times a week: physiotherapy on Fridays and walking on two other days. (2) Self-care goal to seek household support by asking a friend for agency recommendations and discussing with a sibling after the weekend. (3) Follow through with a medical check-up for recent episodes of chest tightness and breathlessness.\r\nWellness vision: Good health means looking and feeling physically well, maintaining strong mental health, and being able to travel and pursue meaningful relationships.\r\n3-month goals: (1) Improve both personal and parental health to enable future travel. (2) Enhance mental wellbeing. (3) Obtain a helper to better support health and caregiving priorities.\r\nEnergy level has been low, impacted by emotional stress. A close friend recently lost a parent, and the client has been affected by witnessing their mother’s ongoing decline in wellbeing, including signs of emotional distress. Client reported poor sleep due to concern for safety at home.\r\nHighlight of the month: Found emotional relief through conversations with a friend in a similar caregiving role. Felt supported and understood through shared experiences.\r\nGoal review: An earlier plan to engage a helper through a personal connection did not work out, requiring a new search. The client has had limited time or capacity to continue with other personal maintenance goals due to caregiving responsibilities.\r\nGenerative moment: Reconnected with personal strengths by discussing ideas for healthy meals, including simple dishes like soup-based meals and adapting recipes from online sources. Expressed fondness for recreating a specific dish from childhood.\r\nMedication: Currently not taking prescribed cholesterol medication. Prefers natural methods and shared anecdotal results from their homemade remedy.\r\nGoal setting: Emphasised that improving a parent’s wellbeing is critical to personal health. Believes that if the household is calmer and the parent sleeps well, personal rest and mental health will also improve.\r\nFuture areas of interest: Revisit strengths and routines from the client's most successful health year to inspire current changes.\r\nAction item: Follow up on medical consultation regarding chest symptoms.",
    "number_of_goals": 3,
    "goals": [
      "Support emotional wellbeing at home by bringing mother out for physical activity three times a week: physiotherapy on Fridays and walking on two other days",
      "Self-care goal to seek household support by asking a friend for agency recommendations and discussing with a sibling after the weekend",
      "Follow through with a medical check-up for recent episodes of chest tightness and breathlessness"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 28,
    "note": "(1) Self-care: Improve living environment by completing repairs, including fixing taps, repainting rooms, and addressing a ceiling leak. (2) Self-care: Explore options for engaging a live-in helper within the next two weeks to provide additional support.\r\nWellness vision: Good health means looking and feeling well both physically and mentally. With a strong body and mind, the client hopes to eventually find a partner and travel overseas.\r\n3-month goals: (1) Improve personal and parental health to prepare for future travel. (2) Enhance mental wellbeing. (3) Engage a helper to support caregiving responsibilities and overall health.\r\nEnergy level was low due to ongoing recovery from illness and a night spent caring for a parent.\r\nClient has taken a follow-up blood test and is awaiting results.\r\nGenerative moment: Emphasised the importance of rest and discussed how to incorporate rest into a demanding routine. Identified that restful sleep is difficult to achieve due to needing to stay alert during caregiving hours. Explored solutions such as giving the parent more structured activities to encourage napping, which would allow the client time to rest. Also noted that deep rest was possible when a sibling provided temporary support. Client acknowledged the need for external help and is actively exploring options, though is hesitant about external services due to time constraints and concerns about the parent’s comfort with unfamiliar individuals. Believes a live-in helper could provide sustainable support but has expressed concerns about finding someone suitable.\r\n3-month goal review: Feels that progress on goals has been limited due to the demands of caregiving. Believes that bringing in a helper would be a key solution to improve both physical and mental health.\r\nStrength: Maintains a strong network of support from friends and family.\r\nAction item: Follow up on blood test results and check progress on arranging a helper.",
    "number_of_goals": 2,
    "goals": [
      "Improve living environment by completing repairs, including fixing taps, repainting rooms, and addressing a ceiling leak",
      "Explore options for engaging a live-in helper within the next two weeks to provide additional support"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 29,
    "note": "(1) Exercise: Arrange an one-hour exercise session with friends every week, 70% confident. (2) App: Explore features of the health app and discuss experience in the next coaching session.\r\nWellness vision: Good health means looking fit, maintaining a strong physique and sound mental wellbeing. With improved health, client hopes to find companionship and travel overseas.\r\n3-month goals: (1) Improve both personal and family health to enable future travel. (2) Support and strengthen mental wellbeing.\r\nClient has a history of heart attacks and is currently on medication including amlodipine and statins, though there are concerns about potential long-term effects of statins on liver and kidney function.\r\nPreviously worked in a sedentary job that involved long hours. Since the cardiac episodes, lifestyle changes have included reducing work hours, quitting smoking, and cutting back on late-night eating.\r\nCurrently providing full-time care for a father with dementia. Night-time caregiving affects sleep quality and daily energy levels. Has expressed interest in getting a helper to relieve some of the caregiving burden.\r\nSleep: Sleep is regularly disrupted and naps are taken during the day to compensate for fragmented rest.\r\nExercise: Physical activity has declined. Client reported persistent fatigue and has not resumed previous routines like jogging or brisk walking.\r\nDiet: Previously maintained a lighter diet with more vegetables and reduced meat. Recently, due to caregiving demands and limited time, meals are often eaten out and tend to be fried, which client associates with recent health concerns.\r\nMental health: Described high levels of stress from caregiving responsibilities, financial strain, and limited independence. Finds small satisfaction in decluttering and maintaining the home environment.\r\nDaily routine involves preparing meals, managing household tasks, and rarely leaving the house due to concern over leaving a parent alone.\r\nSocial support: Keeps in touch with friends through phone calls, and values their emotional support, although rarely meets them in person.",
    "number_of_goals": 2,
    "goals": [
      "Arrange an one-hour exercise session with friends every week, 70% confident",
      "Explore features of the health app and discuss experience in the next coaching session"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 30,
    "note": "(1) Exercise: Engage in at least 240 minutes of moderate to vigorous physical activity per week, including 2 x 2-hour badminton sessions, 2 x 2-hour cycling sessions, and 1 x 15-minute taichi/qigong session, confidence level of 100%. (2) Maintain current dietary pattern of 50% vegetables, 30-35% carbohydrates, and 20% proteins each meal, 5 days a week, confidence of 100%.\r\nContinue with the same exercise and diet goals as the previous month. Client appeared energetic and motivated throughout the session. Goals review: (1) Exercise: Reported increased frequency of cycling, now averaging two sessions per week, each lasting two hours and covering approximately 20km. In total, client engaged in at least 240 minutes of moderate to vigorous physical activity per week, including 2 x 2-hour badminton sessions, 2 x 2-hour cycling sessions, and 1 x 15-minute taichi/qigong session. (2) Diet: Shared that current meals consist of approximately 50% vegetables, 30–35% carbohydrates, and 20% protein. One portion of fruit, usually a banana, is included. Client has adapted well to these dietary changes and reported a weight reduction of 1–2kg, from around 76kg to 75kg. Goal setting: Client expressed the intention to maintain these goals in order to establish a sustainable routine even after the health coaching programme ends. Medication: No issues were reported. Client has remained consistent with medication intake and has not missed any doses. Cholesterol follow-up: A blood test is scheduled for mid-May. Target LDL cholesterol level is 2.1 mmol/L or below. Previous levels were 3.8 and 3.6.",
    "number_of_goals": 2,
    "goals": [
      "Engage in at least 240 minutes of moderate to vigorous physical activity per week, including 2 x 2-hour badminton sessions, 2 x 2-hour cycling sessions, and 1 x 15-minute taichi/qigong session, confidence level of 100%",
      "Maintain current dietary pattern of 50% vegetables, 30-35% carbohydrates, and 20% proteins each meal, 5 days a week, confidence of 100%"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 31,
    "note": "(1) Achieve 10,000 steps two times a week. (2) Reduce the frequency of snacking sweets to three times a week. Client recently returned from a two-week trip overseas. Goals review: (1) Step count goal was initially set at three times a week but was achieved partially due to weather and low motivation after the trip. Success rated 5/10. (2) Increased vegetable intake by including broccoli, carrots, and long beans. Goals setting: (1) Adjusted 10000 steps goal to two times a week with a confidence level of 10/10. (2) Reduce consumption of sweet snacks from once every two days to once every three days, confidence 8/10. Medication review: Took medication daily except for two days during the trip when feeling unwell. Did not use the app reminder as it was not needed to maintain adherence. App usage: Was shown how to sync data from Health Connect to the D-PHA app. Client expressed interest in trying out the steps tracking function. Three-month follow-up scheduled for early 2025.",
    "number_of_goals": 2,
    "goals": [
      "Adjusted 10000 steps goal to two times a week with a confidence level of 10/10",
      "Reduce consumption of sweet snacks from once every two days to once every three days, confidence 8/10"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 32,
    "note": "(1) Search for suitable short courses related to property (2–3 days) and sign up if appropriate. (2) Maintains brisk walking routines (3km round trip to local malls) and continues yoga twice weekly using a 20-minute online video (8/10) (3) Monitor blood pressure daily and record it on a note (9/10). (4) Maintain regular medication intake with app support. (5) Eye screening for cataract planned and ongoing. 3-month goal remains unchanged.\r\nApp usage: Client mentioned that sleep and step count data were not syncing. Was guided to check the phone’s Health Connect settings. Follow-up troubleshooting support was offered if needed.\r\nMedication: Missed two weeks of medication intake due to being logged out of the app.\r\nExercise: Maintains brisk walking routines (3km round trip to local malls) and continues yoga twice weekly using a 20-minute online video. Feels comfortable with current intensity but is considering increasing it when ready. Interested in finding a structured programme with a trainer to support long-term goals.\r\nFamily/social life: Enjoyed a quiet holiday season with family. Anticipates a busier schedule this year due to evening caregiving responsibilities and clinic appointments for a family member.\r\nCognitive health/lifelong learning: Researched financial literacy courses but found them too basic. Looking to take a course in property to inform future decisions on housing. Although daughters work in related fields, client wants to make informed choices independently. Discussed concerns about class costs and ensuring learning outcomes are meaningful.\r\n3-month goal review: Prefers to keep current goals as they feel achievable and motivating. Has made progress in health screening and has taken steps toward consistent physical activity through yoga.\r\nHC review: Was asked about the pacing of sessions and responded positively. Appreciates the structure and goal-setting approach, and finds the combination of coaching and app prompts useful in managing daily stress.\r\nStrengths: Highly goal-oriented, motivated despite occasional setbacks, values independence, and embraces continuous learning. Reiterated the desire to be physically fit, emotionally balanced, and confident in appearance.",
    "number_of_goals": 5,
    "goals": [
      "Search for suitable short courses related to property (2–3 days) and sign up if appropriate",
      "Maintains brisk walking routines (3km round trip to local malls) and continues yoga twice weekly using a 20-minute online video (8/10)",
      "Monitor blood pressure daily and record it on a note (9/10)",
      "Maintain regular medication intake with app support",
      "Eye screening for cataract"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 33,
    "note": "(1) Sign up for a financial course using SkillsFuture credits by the next session. (2) Schedule a full body health screening, either at a polyclinic or privately, by following up with a doctor after the upcoming mammogram. (3) Record blood pressure reading daily before bed time, 10/10 confident. (4) Track the frequency of exercise weekly. 3-month goal remains unchanged. Client recently returned from an overseas trip and experienced a phone-related security issue, which has since been resolved with assistance from family. Life is gradually returning to normal. Acts as a caregiver to a spouse who experienced a recent relapse and is awaiting further updates at the upcoming medical appointment. Client takes an active role in managing their partner’s diet and caregiving needs. Exercise has paused temporarily due to recent disruptions but client expressed strong intention to restart, particularly to rebuild core strength for caregiving purposes. Shared that once the financial course begins, there will likely be more personal time available to be physically active. Social support remains strong, with several friend groups providing regular emotional support. While social outings may reduce temporarily, client feels understood by the circle and continues to lean on them. Energy levels are a key priority right now, with caregiving responsibilities requiring sustained physical and emotional stamina. Medication adherence has improved with the help of app reminders. No concerning symptoms reported, though some neck tightness was noted. Client plans to take daily BP readings before bed and share the data with a doctor at the next appointment. Client is solution-oriented and attributes this mindset to previous fundraising experience. Expressed the belief that problems should be met with action, not avoidance, which provides motivation during times of stress. Strengths include resilience, proactive problem-solving, and an ability to balance responsibilities while seeking growth. A current barrier is scheduling personal tasks around caregiving duties. Future area of interest includes integrating a regular exercise routine around the time spent attending the financial course.",
    "number_of_goals": 4,
    "goals": [
      "Sign up for a financial course using SkillsFuture credits by the next session",
      "Schedule a full body health screening, either at a polyclinic or privately, by following up with a doctor after the upcoming mammogram",
      "Record blood pressure reading daily before bed time, 10/10 confident",
      "Track the frequency of exercise weekly"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 34,
    "note": "(1) Send in FIT stool test to the polyclinic by the next coaching session. (2) Enquire about full body screening at the polyclinic by the next coaching session. (3) Use the app for medication reminders and food diary daily. Wellness vision: To build muscle, strength, and flexibility, and to eventually sign up for taekwondo classes with a grandchild and perform a cartwheel. 3-month goals: (1) Complete a full body screening. (2) Start exercises focused on strength and flexibility. Diet: Eats out regularly with spouse, often visiting locations with a wide variety of options to accommodate different food preferences. Chooses lightly seasoned foods and beverages without sugar but finds dessert a challenge. Typically shares dessert to manage portion size. Describes difficulty sourcing fruits and vegetables when dining out. Exercise: Walks 10,000 steps two to four times a week, often achieved through meal-related errands. Occasionally does Zumba or uses the treadmill at the condo gym. Social life: Active social calendar with regular meetups and travel with family and friends. Enjoys time with a grandchild and provides care one day a week. A parent with dementia resides in a nursing home with adequate support. Mental/cognitive: Interested in taking SkillsFuture courses, particularly in nutrition and health, as long as the learning has practical value. Strengths: Has a history of sustaining dietary changes such as replacing fried breakfast with healthier alternatives over time. Keen to learn and sets practical, attainable goals. Barriers: Dessert preferences and adapting to a partner’s food choices. Finds incorporating fruits and vegetables into meals challenging when eating out. Future areas of interest: Plans to prioritise exercise but is open to improving diet further and potentially taking a useful new course. Action item: Share yoga video links and follow up to assess if the intensity is suitable. Did not include meditation during the session as client was already motivated and able to articulate a wellness vision. More time was spent identifying successful habits and areas where coaching could add value.",
    "number_of_goals": 3,
    "goals": [
      "Send in FIT stool test to the polyclinic by the next coaching session",
      "Enquire about full body screening at the polyclinic by the next coaching session",
      "Use the app for medication reminders and food diary daily"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 35,
    "note": "(1) Consume steamed fish once a week instead of fried fish, 10/10 confident. Client appeared tired and planned to head to work after the session. Reported feeling generally well aside from work-related fatigue. Lifestyle medicine review: Continues to walk to and from work daily, with each trip lasting 10 minutes, six days a week, totaling approximately 120 minutes of walking per week. Enjoys eating vegetables but has not consistently met the goal of two portions at lunch. Often prepares fried long beans with olive oil and does not prefer stir-fried vegetables. Usually consumes fried fish prepared with olive oil. Was encouraged to switch to steamed fish once or twice a week and seemed receptive to the idea, sharing that steamed fish is somethingclientlikes. Medication review: Maintained consistent adherence to medication without missing any doses. Currently takes two pills at night. Concluded the programme by reinforcing the importance of staying consistent with medication and physical activity. Client expressed appreciation and stated an intention to continue maintaining progress.",
    "number_of_goals": 1,
    "goals": [
      "Consume steamed fish once a week instead of fried fish, 10/10 confident"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 36,
    "note": "Continue the goals from the previous session. Client requested a shorter session due to starting a new job as a cleaner at a commercial building. Chose to take up the role to stay physically active and avoid prolonged inactivity at home. Responsibilities include maintaining several floors with light tasks such as sweeping. Since starting work, client has reported feeling more positive and engaged. Recent lab results showed notable improvement in cholesterol levels. Lifestyle medicine review: Walks to and from work regularly, accumulating meaningful physical activity throughout the week. Has been eating vegetables more consistently during lunch. Mentioned occasional difficulty with bowel movements, noting hard stool but no other concerning symptoms. Was encouraged to increase fibre intake by consuming more vegetables. Medication: Completed the previous supply of statins and has not taken them for a short period. Missed a recent medical appointment but plans to visit the pharmacist soon to renew the prescription.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 37,
    "note": "(1) Monitor chest pain under the right side and visit a doctor if symptoms persist. (2) Avoid fried foods and festive snacks, and focus on nourishing meals such as fish soup and home-cooked soup-based dishes. Wellness vision: To travel widely, especially to learn more about cultural roots in India, and to maintain mobility and medication-free health during travels. 3-month goal: Client has personal health goals already defined. Client shared recent illness and low energy, but routines are resuming following a busy festive period. Has returned to work at a preschool and is resuming exercise habits. Currently exercises three times a week and is aiming to increase to four or five times. Energy remains low and client is motivated to improve it. Discussed the importance of listening to the body and monitoring physical discomfort. Client raised concern about a pain under the right side and was advised to seek medical consultation if the discomfort continues. Client believes it may be a muscle strain and prefers to monitor it before taking further steps. Medication: Regular with medication based on self-report. Food log: Actively using the app’s food log to guide portion sizes and improve awareness of meal choices. Strengths: Remains optimistic and resilient in the face of setbacks. Action item: Follow up on chest pain and begin off-boarding discussions to consolidate progress and strengths gained during the programme.",
    "number_of_goals": 2,
    "goals": [
      "Monitor chest pain under the right side and visit a doctor if symptoms persist",
      "Avoid fried foods and festive snacks, and focus on nourishing meals such as fish soup and home-cooked soup-based dishes"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 38,
    "note": "(1) Do brisk walking for 45 minutes per day, 7 days a week (confidence: 6/10). (2) Follow a recovery-friendly diet with more vegetables (50% or more) and soups, and reduced meat intake (less than 25%), at least 5 days a week (confidence: 9/10). 3-month goal not formally set, as client has their own personal goals. Client has been unwell for the past two weeks, spending most of the time resting and experiencing low appetite. Expressed a desire to return to usual routine. Temporarily paused cholesterol medication while taking medication for the illness and plans to resume once fully recovered. Had also paused physical activity but is now reintroducing walking into their routine, starting with 45 minutes and pacing with breaks. Recently started a job at an education centre but took a break due to illness. Described feeling overwhelmed by a long to-do list but concluded the session with the reflection that some tasks can be postponed, and stressing oneself only causes more harm. This insight highlights self-care as a priority. Strengths include strong self-awareness and the use of practical strategies to manage health. Future area of interest includes discussing upcoming Chinese New Year meals and checking in on physical recovery and energy.",
    "number_of_goals": 2,
    "goals": [
      "Do brisk walking for 45 minutes per day, 7 days a week (confidence: 6/10)",
      "Follow a recovery-friendly diet with more vegetables (50% or more) and soups, and reduced meat intake (less than 25%), at least 5 days a week (confidence: 9/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 39,
    "note": "(1) Watch at least one app videos per week and check in with the health coach if there are any questions. (2) Personal goal: Prioritise rest by spending time with family, fixing up the house, cooking, reducing extra commitments, and seeing friends more mindfully. (3) Personal goal: Adjust medication timing from night to morning and take medication daily. 3-month goal not formally set as client is working on personal objectives. Joined the session slightly later than scheduled. Currently working part time and looking forward to a planned break in late December. Has been engaging in several activities including volunteering at major events, whichclientenjoys but finds tiring due to travel. Aware of the need to pace herself and prioritise rest. Medication: Reported that evening medication affects sleep and is planning to trial taking it in the morning, as advised. Has not started yet but intends to do so once their schedule eases. Recent cholesterol readings showed a slight improvement, whichclientwould like to build on. Self-care: Discussed the importance of rest and what it means in practice—more movement, time with their mother, fewer external commitments, social time with friends, and preparing meals at home. Cooking is both a hobby and a self-care practice.clientenjoys trying out healthier versions of dishes, especially home-cooked Cantonese food, asclientfinds outside food too oily or heavily seasoned. Hopes to take a holiday but feels limited by their caregiving responsibilities. Explored how doing thingsclientenjoys at home can also be restorative. Strengths include high energy, strong motivation, and good awareness of their limits. Action item: Follow up on their healthy cooking experiments, especially during Chinese New Year.",
    "number_of_goals": 3,
    "goals": [
      "Watch at least one app videos per week and check in with the health coach if there are any questions.",
      "Prioritise rest by spending time with family, fixing up the house, cooking, reducing extra commitments, and seeing friends more mindfully.",
      "Adjust medication timing from night to morning and take medication daily"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 40,
    "note": "(1) Personal goal: Establish a consistent medication schedule by taking medication daily, 80% confidence. (2) Personal goal: Increase frequency of morning walks from three to five times a week, each time 45 minutes, 70% confidence. Wellness vision: To be able to travel around the world, especially to Japan to learn about the culture and ancestry. To have the mobility and not rely on medication while travelling. 3-month goal not formally set as client is working towards personal goals. Schedule: Recently participated in a full-day work and volunteer event at an international swimming competition. Found the experience tiring but enjoyable, with opportunities to meet new people and watch top athletes. Medication: Largely consistent with intake, using both app reminders and self-prompts. Estimated 80% success over the past month. Next follow-up is scheduled in December. Physical activity: Currently walking three times a week with plans to increase to five. Prefers morning walks and has committed to waking earlier to fit them in. Despite changes in weather, has stayed active with encouragement from friends and family. Generative moment: Once physical activity and medication habits are well-established, there is interest in pursuing a personal development course in 2025. Topics of interest include AI, cooking, and painting. A previous experience with a coding course was manageable and fulfilling. App usage: Watched some videos but found those over five minutes less engaging. Tried the gratitude journal but writing is not a preferred activity. HC affirmed this and encouraged continued exploration of features. Strengths: Strong motivation, steady integration of healthy habits, and social support. Future area of interest: Personal growth through skill development. Action item: Follow up on medical appointment and assess whether current goals should be adjusted.",
    "number_of_goals": 2,
    "goals": [
      "Establish a consistent medication schedule by taking medication daily, 80% confidence",
      "Increase frequency of morning walks from three to five times a week, each time 45 minutes, 70% confidence"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 41,
    "note": "Not ready to set goals at this time; however, client has personal goals related to exercise and diet. Wellness vision: To travel around the world, especially to Japan, to explore culture and ancestry, while maintaining mobility and avoiding reliance on medication during travels. 3-month goal: Not formally set, as client is focusing on self-directed goals. Background: Acts as the primary caregiver for a parent with dementia. Daily routine is structured around caregiving responsibilities, and staying healthy is a key motivation in order to continue providing care. Work: Holds a part-time job, working four days a week with a mix of full and half days. The flexibility allows for better scheduling and supports efforts toward a balanced lifestyle. Exercise: Walks regularly, covering a route between residential and recreational areas at least three times a week. Diet: Prefers home-cooked meals to control salt, sugar, and oil levels. Aims to reduce intake of meat and carbohydrates, and increase vegetable consumption on weekdays. Social life: While most of the schedule revolves around caregiving, client participates in community work once a week for personal fulfilment. Psychological wellbeing: Acknowledges that caregiving can be emotionally demanding and potentially affect overall health. Medication: Adheres to prescribed medications and is choosing to focus on them rather than supplements for now, wanting to observe their effects more clearly. Caregiver: Provides full-time care with support from a part-time nurse twice a week. Strengths: Demonstrates discipline and motivation in setting and following personal health goals. Dedicated caregiver with a flexible job that enables healthy lifestyle choices. Shows vitality and optimism. Barriers: Caregiver stress remains a significant challenge. Future areas of interest: Understanding the impact of stress on health. Next steps: Continue providing space to check in on self-directed goals and offer psychosocial support in future sessions, particularly in relation to managing stress.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 42,
    "note": "2nd SMART Goal: Eat according to healthy plate (i.e. quarter proteins, quarter rice—brown or whole grain—and half the plate of vegetables) for lunch three days a week. Client’s spouse is able to prepare the healthy plate meals three times a week. The healthy plate guide has been shared with the client.",
    "number_of_goals": 1,
    "goals": [
      "Eat according to healthy plate (i.e. quarter proteins, quarter rice—brown or whole grain—and half the plate of vegetables) for lunch three days a week"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 43,
    "note": "No goals decided. Follow-up next session: explore educational content of the app; client plans to start using the app again on Wednesday. Physical health: planning for a colonoscopy as a preventative screening due to family history of cancer. Exercise: attends a weekly Qi Gong class every Monday evening. Finds the sessions enjoyable due to the social aspect, a supportive and clear instructor, and the mental challenge of memorising movement sequences. Has been practicing daily and appreciates the benefits for flexibility and cognitive engagement. Social support: continues monthly meetups with friends, except in December when most are travelling. Values these gatherings while everyone remains active and mobile. Medication: consistently adheres to medication routine, using visual reminders. Also takes medication for nerve-related discomfort, which was explained as age-related degeneration. Previously stopped gout medication after dietary changes on medical advice. Other: shared upcoming travel plans to visit a cultural site, followed by family members continuing travel abroad. Client will stay home to care for the family pet. In conversation, discussed the link between spiritual wellbeing and health. Also mentioned computer issues and plans to visit a repair shop for assistance. App usage: recently received a user guide and intends to use it to explore app features. Will review content and discuss in the next session. Action item: follow up on app engagement and educational content viewed.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 44,
    "note": "1. Homecook at least one meal a day, 7 days a week (Confidence: 80%). 2. Exercise (walking) but with increased intensity and pace for one hour in the morning, three days a week (Confidence: 100%). 3. Take medications every day in the morning (breakfast time) (Confidence: 100%). Client expressed strong motivation to lower LDL cholesterol and recognised the need for changes beyond physical activity alone. Goals review: 1. Cooked oats with milk for breakfast three times a week on alternate days. (Confidence level: 80%) Success rate: 100% 2. Switched to steam cooking three times a week. (Confidence level: 80%) Success rate: 100% (Client ended up cooking daily.) 3. Continued walking for one hour in the morning, three times a week. (Confidence level: 80%) Success rate: 100% (Completed 3 hours of walking per week.) App review: 1. Consistently used the food diary three times daily without missing a day since onboarding. 2. Dietary intake was discussed based on diary photos. 3. Introduced to MyHealthy Plate and encouraged to share it with friends and family. Goals setting: Client opted to maintain the same weekly goals as they were recently introduced. 1. Homecook at least one meal a day, 7 days a week. 2. Walk in the morning for one hour, three days a week, increasing intensity. SPAG guidance on 150 minutes of moderate to vigorous activity per week was explained. Previously engaged in light intensity walking (able to talk and sing). Now encouraged to alternate brisk and regular walking (able to talk but not sing). 3. Continue taking medications daily with breakfast. Gastric discomfort previously reported has resolved. No other side effects reported.",
    "number_of_goals": 3,
    "goals": [
      "Homecook at least one meal a day, 7 days a week (Confidence: 80%)",
      "Exercise (walking) but with increased intensity and pace for one hour in the morning, three days a week (Confidence: 100%)",
      "Take medications every day in the morning (breakfast time) (Confidence: 100%)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 45,
    "note": "1. Cook oats with milk at home for breakfast three times a week on alternate days. 2. Switch to steam cooking three times a week. 3. Exercise (walking) for one hour in the morning three days a week. Client is retired and lives with siblings. Medical history includes high cholesterol and hypertension. Weekly goals: 1. Cook oats with milk at home for breakfast three times a week on alternate days (confidence level 80%). 2. Switch to steam cooking three times a week (confidence level 80%). 3. Exercise (walking) one hour in the morning three days a week (confidence level 80%). App usage: not interested in medication reminders or videos. Medication: previously skipped cholesterol medication believing exercise was sufficient. Recently resumed medication but experienced gastric discomfort. Advised to monitor symptoms and inform care team at next follow-up.",
    "number_of_goals": 3,
    "goals": [
      "Cook oats with milk at home for breakfast three times a week on alternate days (confidence level 80%)",
      "Switch to steam cooking three times a week (confidence level 80%)",
      "Exercise (walking) one hour in the morning three days a week (confidence level 80%)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 46,
    "note": "1. Exercise (swimming) for a minimum of 70 minutes per week. 2. Homemade salad for breakfast twice a week, buy salad as alternative if needed. 3. Take medications every day of the week. Client appeared highly motivated by recent blood test results and expressed appreciation for the support received from both the health coach and healthcare team. Recently returned from a trip abroad with colleagues, participated in island activities and swimming. Clinic visit: cholesterol level has improved and is now within target range, HBA1c slightly increased from previous value. Discussed hypertensive medication with clinician due to bradycardia. Goals review: 1. Swimming and aquarobics at least once a week, completed most weeks and stayed active during the trip. 2. Ate homemade or store-bought salad for breakfast once a week or more, depending on work schedule. 3. Took medication daily; occasionally skipped app logging when taken outside of reminder times. Goals setting: 1. Swim or do aquatic exercises for at least 70 minutes per week (confidence 100%). 2. Consume homemade salad for breakfast twice a week, or buy salad as alternative if needed (confidence 80%). 3. Take statin medications daily. Lifestyle medicine review: discussed guideline of 150 minutes moderate intensity physical activity weekly, explained how to self-assess intensity using the talk and sing method. App usage: client completed all modules, found the videos helpful except for meditation content. Asked proactively about food diary and self-reflection features, received a demonstration and will continue using these. App diary will be reviewed in the next session.",
    "number_of_goals": 3,
    "goals": [
      "Swim or do aquatic exercises for at least 70 minutes per week (confidence 100%)",
      "Consume homemade salad for breakfast twice a week, or buy salad as alternative if needed (confidence 80%)",
      "Take statin medications daily"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 47,
    "note": "1. Swimming and aquarobics for 30 minutes once a week. 2. Homemade salad for breakfast once a week, buy salad as alternative if busy. 3. Take medications every day of the week. Client recently returned from a trip with a friend that included food outings and leisure travel. Goals review: 1. Aquatic exercises were done once a week due to work commitments, perceived success 40-50%. 2. Had breakfast three times a week, usually bread and coffee, perceived success 100%. 3. Took medications 6 out of 7 days, found pillbox and app reminders helpful especially after late shifts, perceived success 100%. Generative moment: Participated in stretching activities at a local centre, signed up for weekly sessions and began socialising through games. Goals setting: 1. Continue swimming and aquatic exercises once a week (confidence 100%). 2. Consume homemade salad as breakfast once a week, with flexibility to buy if necessary (confidence 50%). 3. Take statin medications every day of the week (confidence 90%). App usage: Frequently used medication reminders, watched a few videos but cited lack of time. Other concerns: Currently adjusting antihypertensive medication under physician’s guidance due to low heart rate and elevated BP readings. Client was instructed to monitor and record BP and heart rate daily using the app diary and dictation tool.",
    "number_of_goals": 3,
    "goals": [
      "Continue swimming and aquatic exercises once a week (confidence 100%)",
      "Consume homemade salad as breakfast once a week, with flexibility to buy if necessary (confidence 50%)",
      "Take statin medications every day of the week (confidence 90%)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 48,
    "note": "Regular mealtime, regular exercise, medication routine. A retiree living with daughter and one grandchild. Medical history includes hyperlipidaemia (on statins and ezetimibe), hypertension, and osteoarthritis in the knees currently managed with physiotherapy. Had a misunderstanding about cholesterol medication side effects and previously forgot to take medications frequently (4–5 times a week). Wellness vision: improve immune system to avoid frequent cough and flu, and travel without knee pain. Three-month goals: 1. Maintain regular mealtimes, especially breakfast. 2. Engage in consistent aquatic exercises to reduce knee discomfort. Weekly goals: 1. Do aquatic exercises (walking and swimming in the pool) for 30–45 minutes, at least three days a week. 2. Have breakfast at least two days a week, one slice of bread with coffee. 3. Use a pillbox to take medications at least five days a week before dinner.",
    "number_of_goals": 3,
    "goals": [
      "Do aquatic exercises (walking and swimming in the pool) for 30–45 minutes, at least three days a week",
      "Have breakfast at least two days a week, one slice of bread with coffee",
      "Use a pillbox to take medications at least five days a week before dinner"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 49,
    "note": "(1) HC set: Continue using app features and discuss in the next session. Wellness present: Currently living in a state of good health—structured lifestyle, balanced diet, positive mindset, minimal worries, able to meet others, travel occasionally, stays active through regular exercise. 3m goal: No goals set. Reasons for joining: Interested in learning more about cholesterol and general health. Family background: Lives with a partner, one adult child living nearby. Health/medical history: Elevated cholesterol, high blood sugar. Medication: Recently prescribed a higher dose of cholesterol medication. Encouraged to discuss concerns with primary care team. Routine: Morning includes breakfast, light activity, and housework. Afternoons involve a simple home-cooked meal, short walks, and light rest. Evenings typically include dinner and watching TV. Enjoys light gardening. Diet: Previously had heavier breakfast options but has switched to lighter choices like tofu and wholegrain bread with unsweetened drinks. Meals tend to be vegetable-based soups and minimal rice. Goal setting/wellness vision: Describes current state as ideal health. Views ageing as natural decline and is content with current efforts. HC explored openness to preventive strategies but individual was not inclined to adjust routines. HC approach: Focused on meeting client where they are, acknowledged interest in knowledge and shared relevant app content. App usage: May require additional technical support to navigate mobile features. Strength: Maintains consistent routine and discipline. Action item: Explore perception of wellbeing changes, and share selected app content.",
    "number_of_goals": 1,
    "goals": [
      "Continue using app features and discuss in the next session"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 50,
    "note": "(1) Diet: Reduce intake of rice, increase intake of vegetables, and maintain usual portion of meat during the fasting (Ramadan) period. (2) Medication: Take medication every day using the app reminder (3) For April: Start exercising. Wellness vision: To feel good, do anything independently, travel, and not rely on others. 3m goal (1): Reduce cholesterol levels 3m goal (2): Reduce weight from approximately 74kg to around 70kg 3m goal (3): Reduce consumption of oily food. Reasons for joining: Fluctuating cholesterol levels, wants to bring them to a healthy range. Family: Lives with a sibling, occasionally visits extended family members. Lifestyle: Homemaker, does household chores daily, prepares meals, and runs errands. Health: Elevated cholesterol and blood sugar, on regular medication, doctor advised to begin exercising. Diet: Includes vegetables and fruits, limits carbohydrate intake, enjoys seafood twice weekly. Exercise: Has not exercised in the last two years but was more active during the pandemic, interested in restarting walks. Weekends currently focused on errands and visiting the local market. Acknowledges that household chores differ from exercise. Analogy: Treats housework as daily maintenance, HC likened this to maintaining health through small, daily habits. Role model: An older neighbour who remains active through gardening and walking. Strength: Past experience with physical activity, inspired to live healthily, flexible daily schedule. Future areas of interest: Exploring diet and integrating exercise into daily life. Action item: HC encouraged watching videos on cholesterol and plans to revisit exercise discussions in the next session.",
    "number_of_goals": 3,
    "goals": [
      "Reduce intake of rice, increase intake of vegetables, and maintain usual portion of meat during the fasting (Ramadan) period",
      "Take medication every day using the app reminder",
      "Start exercising"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 51,
    "note": "(1) Exercise: Walk 10k steps daily in the morning or night, depending on teaching schedule (2) Exercise: Add incline in walks by going for hikes during upcoming trip (3) Diet: Monitor food intake and blood glucose trends by logging them into a separate app (4) Medication: Set daily reminders and take medication consistently (10/10 confidence). Wellness Vision: To stay mobile, energetic, happy and independent in order to enjoy life, spend time with loved ones, pursue hobbies like programming and biking, and avoid burdening others 3m goal: (1) Start exercising regularly (2) Start taking medication regularly (3) Improve diet Energy levels: 6-7/10 Grateful for health: Recent full body screening showed LDL in desirable range, though blood glucose remains high Goal review (1): Averaging 8k steps per day, motivated by health goals and observing others with illness; has not started weight lifting due to recent travel Goal review (2): Medication taken with a nightly alarm at 10:10pm; missed occasionally due to inconvenience accessing pills; plans to move medications to a more accessible location Goal review (3): Becoming more mindful of diet but continues to enjoy food, making moderation a challenge App usage: Found videos informative, especially on heart attack symptoms; uses personal journal for reflections instead of app Generative moment: Discussed aging and strength maintenance; identified protein sources and building muscle mass through future weight training Goal setting: Increase to 10k steps daily, split into two walks if needed due to park closure or teaching schedule; track food and corresponding glucose readings to better understand body response; 10/10 confidence in medication adherence Strength: Motivated to stay healthy and implement lifestyle changes Barriers: Frequent travel for teaching but finding creative workarounds Future areas of interest: Explore nutrition resources Action item: Follow up on food tracking experiment and any observed trends.",
    "number_of_goals": 4,
    "goals": [
      "Walk 10k steps daily in the morning or night, depending on teaching schedule",
      "Add incline in walks by going for hikes during upcoming trip",
      "Monitor food intake and blood glucose trends by logging them into a separate app",
      "Set daily reminders and take medication consistently (10/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 52,
    "note": "(1) Walk three times a week in the mornings or when there is no teaching scheduled. (2) Take statin medications daily and turn on notifications for medication reminders in the app. Wellness vision: To be mobile, energetic, happy and independent so that I can enjoy my life, my grandchildren, my friends, not being a burden to my children, things that I love (e.g. programming, riding a bike, documenting my life). 3m goal: (1) Start exercising regularly (2) Start taking my medication regularly (3) Improve my diet Reasons for joining: Looking forward to an improvement in health Note: Client travels to South Korea frequently. Medical hx: High cholesterol, diabetes (well controlled), BP ok. Medication: Does not take statins regularly due to concerns of side effects, but after HC session - shared willingness to try. Takes 3x a day diabetes medication. Support system helps with packing medication but adherence drops during travel. Energy levels: Finds energy levels to be a hindrance and would like to improve overall health to address it. Sleep: No major issues reported, but sleep latency may be a topic for future sessions. Diet: Eats at food centres, finds it challenging to choose healthy food. Open to learning more and referred to Health Hub and app resources. Exercise: Used to jog, interested in resuming walking. Purchased dumbbells and plans to start strength training. Support system: Has support from spouse for exercises and medication routine. Personal interest: Interested in programming and AI, working on an autobiography. App features: Open to educational content, less keen on food diary. Strength: Insightful and motivated to manage health. Future areas of interest: Self-learning resources and applying knowledge to build habits. Action item: Follow-up with goal summary.",
    "number_of_goals": 2,
    "goals": [
      "Walk three times a week in the mornings or when there is no teaching scheduled",
      "Take statin medications daily and turn on notifications for medication reminders in the app"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 53,
    "note": "1. Two times of walking exercise per week, 30 minutes each time, on weekend (Confidence 7/10). 2. Consume four times of vegetables per week by adding vegetables to breakfast before fasting (Confidence 7/10). Client just returned from an overseas business trip. Started fasting there, reported to have a difficult time controlling diet while abroad but managed to do so eventually. Reported approximately 1.5kg of weight loss since fasting month began. Client is very proactive about taking care of health, well-spirited, with strong family support. Client is keen to challenge themself but acknowledged the importance of taking baby steps. Client reported taking medication every day in the past month without missing any dose. Client was affirmed and encouraged to continue this streak. Diet: discussed the challenges of controlling diet during fasting month. The food distractions in night markets and the lack of vegetables. The effect of over hunger on tendency to overeat. Confidence level: 7/10.",
    "number_of_goals": 2,
    "goals": [
      "Two times of walking exercise per week, 30 minutes each time, on weekend (Confidence 7/10)",
      "Consume four times of vegetables per week by adding vegetables to breakfast before fasting (Confidence 7/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 54,
    "note": "1. Exercise: Do exercises 4 times a week, including walking, stretches, knee exercises from radio and online videos (8/10 confidence) 2. Exercise: Try different styles of exercise 3. Reduce the intake of oily or spicy foods and replace with tofu, beans, and fruit 4. Watch online videos, radio shows and documentaries on healthy living Client did not state a formal wellness vision but shared wanting to stay healthy to continue travelling and exploring the world 3-month goals: keep fit, eat healthy, drink more water Energy levels: normal, had fried potato for breakfast Exercise goal: started walking 3x a week, feels more energetic Nose sensitivity: less irritation, possibly related to seafood Constipation: improved, goes more regularly, drinks more water, avoids late meals Overall feels less tired since starting new habits Eats healthily most of the time, cooks with less salt, oil and sugar, and is reminded by family to do so Recently added new 3-month goal of increasing water intake Shared upcoming travel to a mountainous region, aware food may be oily and intends to eat in moderation Action plan: share app videos weekly to encourage engagement",
    "number_of_goals": 4,
    "goals": [
      "Do exercises 4 times a week, including walking, stretches, knee exercises from radio and online videos (8/10 confidence)",
      "Try different styles of exercise",
      "Reduce the intake of oily or spicy foods and replace with tofu, beans, and fruit",
      "Watch online videos, radio shows and documentaries on healthy living"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 55,
    "note": "1. Exercise to prepare for upcoming trip: Do knee-strengthening exercises following online videos for at least 3 times a week, each lasting 60 minutes (8/10 confidence) 2. Explore educational content in app 3. Nose: Wear a mask while cleaning to reduce allergen exposure 4. Constipation: Increase water intake above current three glasses Wellness vision: wants to stay healthy to continue travelling and exploring the world 3-month goals: keep fit, eat healthy Energy level: reported feeling fine this week, maintains routine of cooking, part-time work, and learning activities Past month included festive activities, cooking for family, and attending a wedding Diet: enjoys cooking and trying new recipes, including western and spicy dishes, often inspired by online content Typical day includes home-cooked lunch with rice and vegetables, and purchased dinners with protein and vegetables Occasionally has tea or coffee with biscuits, eats a variety of vegetables and fruits Defines healthy eating as higher vegetables and fruits, less oil, salt, and sugar Exercise: physically active with household chores, sometimes walks 20k steps with family or friends Medication: consistently takes cholesterol and joint-related medications at night Vacation: planning to travel to a mountainous area and wants to strengthen knees App usage: limited in the past month but agreed to explore videos before next session Health concerns: asked about sensitive nose and constipation, advised to increase water intake and consult doctor for further checks Motivation: wants to stay healthy and independent, influenced by seeing others become unwell Coaching approach: prefers guidance and knowledge-sharing, HC clarified scope of support and agreed to include more educational content in sessions",
    "number_of_goals": 4,
    "goals": [
      "Do knee-strengthening exercises following online videos for at least 3 times a week, each lasting 60 minutes (8/10 confidence)",
      "Explore educational content in app",
      "Wear a mask while cleaning to reduce allergen exposure",
      "Increase water intake above current three glasses"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 56,
    "note": "1. Adhere to My Healthy Plate three times a week at lunch, with or without 25% portion of carbohydrates Client looked happy and generally well Medication review: LDL cholesterol at baseline was 3.1 previously achieved 2.6 but stopped taking statin after that currently taking medication every day Goal review: managed to follow My Healthy Plate three times a week but concerned about 25% rice due to blood glucose advised to omit carbohydrates at discretion and focus on 50% vegetables and 25% proteins Diet review: consumes a plant-based dinner daily at 5pm with no food intake after 6pm follows intermittent fasting . includes a variety of vegetables such as cucumber cabbage broccoli and cauliflower cooking methods include boiling and stir-frying with olive oil adds 7g butter 5g coconut oil and olive oil to morning coffee informed about high saturated fats in coconut oil and its effect on LDL advised to reduce or omit coconut oil and consult physician or pharmacist to be reviewed in next session Physical activity review: engages in one hour of exercise every evening including walking running and resistance exercises meets physical activity recommendations so no additional goal set",
    "number_of_goals": 1,
    "goals": [
      "Adhere to My Healthy Plate three times a week at lunch, with or without 25% portion of carbohydrates"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 57,
    "note": "1. Diet: Reduce dinner portion size by having bread with cheese, vegetables, spreads, or bacon for dinner instead of a heavy dinner (6/10 confidence). 2. Exercise: Go for more bowling sessions with friends 3. Exercise: Restart walking routine 4. HC: Share notifications of videos and ask if it helped Wellness vision: To have no major illness so that family and self do not suffer to enjoy family time and have good quality of life defined as peace in the family 3month goal: gradual reduction of weight from around 75kg to 70kg Energy level: 5/10 due to work colleague left resulting in increased workload copes by setting boundaries with supervisor Highlight: was sick before during and after recent overseas trip spent the month recovering including more sleep from 10pm to 7am instead of 11pm to 7am grateful for maintaining weight Goal review exercise: did not start walking due to busy schedule but achieves around 10k steps on weekdays through work went for 2 bowling sessions with friends considers this physical activity Goal review diet: did not reduce breakfast intake forgot goal and felt hungry but started cutting down dinner portions replacing heavy meals like roast duck and fried noodles with bread motivated to prevent weight gain App usage: did not use app due to busy schedule not very keen on reminders Generative moment: approaching semi-retirement in June negotiating new terms looking forward to reduced work week bowling sessions time at the gardens and couple trip with spouse likened to a second honeymoon excited after 40 years of work Goal setting: initially reluctant to set goals preferred living day to day later shared intention to continue diet and resume exercise acknowledges current workload and stress as barriers Action item: link app video reminders for evening use",
    "number_of_goals": 3,
    "goals": [
      "Reduce dinner portion size by having bread with cheese, vegetables, spreads, or bacon for dinner instead of a heavy dinner (6/10 confidence)",
      "Go for more bowling sessions with friends",
      "Restart walking routine"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 58,
    "note": "1. Exercise: Complete 5km walk two times a week from midweek onwards. 2. Diet: Reduce intake of breakfast everyday 3. Explore features of app and share with HC what fits lifestyle Wellness vision: To have no major illness so that family and self do not suffer to enjoy family time and good quality of life defined as peace in the family 3month goal: gradual weight reduction from around 75kg to 70kg Energy level: Normal recovering from cough and sleeping more to support recovery Health status: Noticed increased BP during festive period identified causes as disrupted sleep lack of exercise festive foods currently monitoring BP regularly Goal review: Stress levels dropped from 8 to 4 due to new employee support planned upcoming trip with friends highlight of the month was reconnecting with family during festivities diet discipline shown by limiting snacks like pineapple tarts Family: Comes from a large family with several siblings Diet: Aims to cut portions breakfast includes beehoon and kueh lunch usually canteen food whichclientfinds bland but eats to support vendors avoids food delivery dinner often includes fried foods and tofu-based yong tau foo as tofu is a favorite App usage: Consistent with medication but not using video features HC recommended viewing videos before next session Next session: Ask about trip and follow up on BP levels",
    "number_of_goals": 3,
    "goals": [
      "Complete 5km walk two times a week from midweek onwards",
      "Reduce intake of breakfast everyday",
      "Explore features of app and share with HC what fits lifestyle"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 59,
    "note": "1. Reduce oil intake during festive season 2. Explore app features and share with HC what suits lifestyle 3. Prioritize rest at end of each day through music vacation planning and self-care 4. Reduce unhealthy food intake during Chinese new year by minimizing visits or staying home Wellness vision: To have no major illness so that family and self do not suffer to enjoy family time and good quality of life defined as peace in the family 3month goal: Maintain weight without increase or drastic decrease Work: New studies starting and fewer colleagues led to increased workload preventing regular exercise and disrupting healthy routines Self-care: Disconnects from work by playing phone games listening to music watching videos 8/10 effectiveness uses acceptance and focus techniques to manage stress enjoys planning vacations and is considering retirement to travel more Travelling: Has 2 trips planned one with colleagues one with spouse enjoys travel for social learning and budgeting experiences Physical activity: Still walks at work but stopped daily walking due to exhaustion and weather bowled twice in the past month App usage: Used app for 15 minutes due to fatigue encouraged to explore it more Generative moment: Staying healthy supports travel and reduces future healthcare costs HC feedback: Current pace appropriate Barriers: Workload expected to improve after festive period Action item: Follow-up on stress levels and festive season experience",
    "number_of_goals": 4,
    "goals": [
      "Reduce oil intake during festive season",
      "Explore app features and share with HC what suits lifestyle",
      "Prioritize rest at end of each day through music vacation planning and self-care",
      "Reduce unhealthy food intake during Chinese new year by minimizing visits or staying home"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 60,
    "note": "1. Reduce oil intake during festive season 2. Explore app features and share with HC what suits lifestyle Wellness vision: To have no major illness so that family and self do not suffer to enjoy family time and good quality of life defined as peace in the family 3month goal: Not set Reasons for joining: Curious to understand what the study is about Age: Early sixties Health condition: One eye lost from accident in late twenties has high blood pressure well managed high cholesterol and hip replacement limiting heavy lifting Physical activity: Used to jog currently walks around ten thousand steps daily from work and leisure walks at the park has maintained walking habit since the pandemic motivated by enjoyment and music Family: Lives with spouse and child values family time worries about family unity after older generation passes Diet: Food choices mostly influenced by spouse recent festive period included buffets and alcohol linked to high cholesterol adjusts portions to be healthier enjoys fried food in moderation Health management strategies: Takes blood pressure medication manages stress by setting boundaries at work and maintaining positive thinking which helps sleep quality Strength: Resilient adopts mindset of self-acceptance focuses on what can be controlled Barriers: Festive eating patterns may hinder cholesterol control not yet ready to make changes Action item: Build rapport start slow explore existing habits in future sessions",
    "number_of_goals": 2,
    "goals": [
      "Reduce oil intake during festive season",
      "Explore app features and share with HC what suits lifestyle"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 61,
    "note": "(1) Exercise: Do weight-lifting three times a week, swim once a week on weekend, and walk everyday for a minimumof 30mins (confident 7/10) (2) Diet: Fast on Monday and Thursday, eat small portions for meals (Confident 8/10) (3) Medication: Take statin medication everyday (confident 9/10) Wellness vision: To feel fresh and active and have energy to travel the world not visit doctor often and not be a burden to children at old age 3-month goals: (1) To be more active (2) Relax mind from work Energy level high better than normal attributed to fasting and prayers past month Highlight: Fasting and diet brought clarity acceptance and trust in faith supported stress relief and daily prayers beneficial Goal review: Confident 08/10 about diet progress continues mindful eating avoids grains potato sugar portion sizes reduced not influenced by family when eating out Generative moment: Willpower learned from parent applies discipline to achieve goals discussed applying willpower to diet and exercise Herbs: Takes flax seed oil black seed and fenugreek occasionally researched their benefits Gratitude: Ended session with gratitude and strong motivation Strength: Willpower and structured life follows plans Future areas of interest: Final session review requested Action plan: Summarize sessions reflect on strengths focus on maintenance",
    "number_of_goals": 3,
    "goals": [
      "Do weight-lifting three times a week, swim once a week on weekend, and walk everyday for a minimumof 30mins (confident 7/10)",
      "Fast on Monday and Thursday, eat small portions for meals (Confident 8/10)",
      "Take statin medication everyday (confident 9/10"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 62,
    "note": "(1) Diet: While breaking fast, take small portions of healthy foods such as fruits and tea. Wellness vision: To feel fresh and active and have energy to explore new places not visit doctor often and not be a burden to children at old age 3-month goals: (1) To be more active (2) Relax mind from work Energy level: Recovered from illness caught during overseas trip feeling 90% better Experience abroad: Spent two months away most memorable in a familiar region with siblings enjoyed support long walks fresh food traditional cooking methods felt energized Pilgrimage included daily walking but fell ill for several days support was provided by spouse Next possible trip is being considered to visit family abroad Goal review: Rated 15/10 success for brisk walking goal could not swim due to illness 3-month goals unchanged Stress: Main source is financial managed through work values independence despite children’s offer to help Health check: Within range attributes improvement to small portions healthy snacking vegetables and fruit walking and less stress Goal setting: No exercise or app goals during fasting plans to resume swimming and walking after April diet goal is mindful breaking of fast Strength: Strong internal motivation supported by family and social network Future areas of interest: Follow up on swimming brisk walking app usage",
    "number_of_goals": 1,
    "goals": [
      "While breaking fast, take small portions of healthy foods such as fruits and tea"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 63,
    "note": "(1) Do brisk walking 3 to 4 times a week between 5pm and 6pm, and if it rains do home-based exercise following an online video at home (confidence 8/10) (2) Swim at least once a week (more if possible), each time 30-45 minutes (confidence 7/10) (3) Watch at least one educational video on the CADENCE D-PHA app. Wellness vision to feel fresh and active and have energy to explore new places avoid frequent doctor visits and not be a burden to children at old age 3-month goals (1) To be more active (2) Relax mind from work Social life recently hosted many guests at home due to child’s wedding Exercise was consistent for two weeks then paused due to busyness felt body aches but also felt healthier and tuned in to physical limits Diet started cooking own meals such as steamed vegetables and proteins App usage did not view videos due to hectic schedule Generative moment swimming is a full-body workout provides motivation encourages spouse to join emphasizes desire for health and independence confident in ability to meet exercise goals No change to 3-month goals Will be away from Dec to mid-Feb on a long journey involving multiple regions expects to be physically active and recalls losing weight on a similar trip in the past Did not do mindfulness practice due to time constraints Not keen on exploring more app features Strength personally motivated confident in follow-through Future interest diet exercise calming the mind Action item share resources on benefits of swimming",
    "number_of_goals": 3,
    "goals": [
      "Do brisk walking 3 to 4 times a week between 5pm and 6pm, and if it rains do home-based exercise following an online video at home (confidence 8/10)",
      "Swim at least once a week (more if possible), each time 30-45 minutes (confidence 7/10)",
      "Watch at least one educational video on the CADENCE D-PHA app"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 64,
    "note": "(1) Start exercising: Brisk walking 3 to 4 times a week between 5pm and 6pm. (confidence 7/10). (2) Start exercising: Lifting light weights once a week between 4pm and 6pm (confidence 7/10). (3) View educational content: on the CADENCE D-PHA app. Wellness vision: to feel fresh and active and have energy to explore new places, avoid frequent doctor visits, and not be a burden to children at old age. 3-month goals: (1) To be more active. (2) Relax mind from work. Reasons for joining: would like to start exercising and was recommended by the doctor. Work: mostly sedentary for long hours, moderate stress, and would like to explore ways to relax. Health condition: diagnosed with high cholesterol and BP for several years. Medication: recently stopped medication for two months due to concerns about organ health based on information from others. Supplements: drinks a traditional herbal mix of black seed and fennel seed passed down through generations. Diet: follows a strict home-cooked diet, low in carbohydrates, high in proteins, prefers steamed vegetables, uses olive oil, avoids bakery items, and manages diet even when eating out. Exercise: used to be regular but currently less active due to tiredness and rainy weather. Motivated to restart. Social support: supportive spouse attended part of the session, preparing for a family wedding. Strength: disciplined and determined, especially in dietary habits. Future area of interest: relaxation of the mind to be explored in future sessions. Action item: recommend educational videos on medication, follow up in next session.",
    "number_of_goals": 3,
    "goals": [
      "Brisk walking 3 to 4 times a week between 5pm and 6pm. (confidence 7/10)",
      "Lifting light weights once a week between 4pm and 6pm (confidence 7/10)",
      "View educational content: on the CADENCE D-PHA app"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 65,
    "note": "Attended the 3-month follow-up visit: was informed of a reduction in LDL cholesterol, though still not within target range. HBA1c was 8.0. New vision: better manage blood glucose to avoid initiation of insulin therapy. Goals setting: (1) Adhere to MyHealthy Plate at least once a week, confidence level: 8/10. (2) Increase intensity and duration of exercise. Lifestyle medicine: (1) Briefed on MyHealthy Plate proportions. (2) Informed of guideline recommendations for physical activity. (3) Explained how exercise helps reduce blood glucose and how glucose functions in the body. client has been measuring and comparing glucose levels after breakfast and post-exercise in the evening. Expressed appreciation for learning from the HCP and HC. Appeared more motivated and open in this session compared to previous ones.",
    "number_of_goals": 2,
    "goals": [
      "Adhere to MyHealthy Plate at least once a week, confidence level: 8/10",
      "Increase intensity and duration of exercise"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 66,
    "note": "1. Exercise: 30–60 mins of jogging around building three times a week after work and on weekends. (confidence 9/10)\r\n2. Diet: Switch from roti prata to homemade oats three times a week. (confidence 7/10)\r\n3. Use a post-it note near bed as reminder for evening medications. nGoals review:\r\n(1) Jogged once during the weekend. Success rate: 40%. Positive experience: felt refreshed. Challenge: unable to run continuously, did intermittent running with breaks. Reassured this is normal for beginners.\r\n(2) Took medication bags out for breakfast on weekends. Success rate: 90%. Positive experience: took morning medications consistently. Challenges: forgot night doses, reminders ineffective due to phone on silent mode.\r\n(3) Reduced prata from 2 to 1 serving once a week, switched to oats at home. Positive experience: felt healthier. Challenges: oats became boring to eat daily and relied on spouse to prepare them. App review: Did not use reminders or view content. Guided on logging medication reminders. Advised to watch video in module 3.2 to discuss next session. Initially struggled to log in.",
    "number_of_goals": 3,
    "goals": [
      "30–60 mins of jogging around building three times a week after work and on weekends. (confidence 9/10)",
      "Switch from roti prata to homemade oats three times a week. (confidence 7/10",
      "Use a post-it note near bed as reminder for evening medications"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 67,
    "note": "1. Reduce the consumption of coke zero from twice daily to once daily. 2. Limit the snacking to once daily. Medical conditions: hypertension, diabetes, and hypercholesterolaemia. Diagnosed a few years ago when experiencing blurred vision. Presented to polyclinic and confirmed the diagnoses. Currently taking medications: HTN and DM after breakfast, atorvastatin after dinner at 9pm. Lifestyle: 1) Started doing brisk walking on treadmill at home recently, stopped intermittently due to knee pain. 2) Diet: consumed sodas every day at lunch and dinner, likes the taste of sodas. Consumes snacks every day when watching TV at home. Aware of unhealthy diet and would like to make progressive changes. Wellness vision: to be able to live independently and not be dependent on the care of others, travel with family, and spend quality time with family. 6-month goal: weight reduction of 3kg. Weekly goals: 1) Reduce the consumption of coke zero from twice daily to once daily (confidence 7/10). 2) Limit frequency of snacking to once daily (confidence 7/10). App usage: 1) Explored the videos in Theme 1 before the first session. 2) Encouraged to log the medication reminders.",
    "number_of_goals": 2,
    "goals": [
      "Reduce the consumption of coke zero from twice daily to once daily (confidence 7/10)",
      "Limit frequency of snacking to once daily (confidence 7/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 68,
    "note": "1. Exercise: Exercise daily for at least 1 hour. 2. Diet: Reduce portion sizes for all meals, choose healthier ingredients, and add vegetables and fruits into home-cooked meals. 3. App (HC): Watch module 5 video and discuss with HC next session. Wellness vision: To live a longer healthier life, enjoy food, sleep well, travel, and avoid illness. 3-month goals: 1. Reduce weight. 2. Lower cholesterol. 3. Lower blood sugar. Energy level: High as it was the start of the week. Highlight: Went to the beach with husband, chose healthier meal, felt happy and relaxed. Goal review 1: Exercise—Been exercising 4–5x a week for 2 hours using machines near their block, walks after sending grandchild to school. Rates progress 7/10, motivated to increase frequency. Goal review 2: Diet—Weekdaysclientcooks simply with oats or bread for breakfast and vegetables with meat for other meals. Weekendsclienteats out with family and tries to choose healthier options like smaller portions and more vegetables. Dessert includes chng tng, green bean soup, sugar cane. HC advised caution on sugar cane drinks. Goal review 3: App—Watched heart health videos but didn’t have time for others. Generative moment: Enjoys cooking a wide range of vegetables and feels proud of their meals. Mental health: Mentioned feelings of loss with aging. HC acknowledged and offered to discuss more next session. Strength: Motivated, disciplined, sets personal goals. Future interest: Mental health. Action items: Share healthy plate photos and videos, help sustain current behaviors.",
    "number_of_goals": 3,
    "goals": [
      "Exercise daily for at least 1 hour",
      "Reduce portion sizes for all meals, choose healthier ingredients, and add vegetables and fruits into home-cooked meals",
      "Watch module 5 video and discuss with HC next session"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 69,
    "note": "1. Exercise: Exercise daily for at least 1 hour. 2. Diet: Reduce portion sizes and adjust ingredients to healthier options. 3. App (HC): Explore app features and share what is useful. Wellness vision: To live a longer happy life, eat what I want, sleep well, travel, and stay healthy. 3-month goals: 1. Reduce weight. 2. Lower cholesterol. 3. Lower blood sugar. CNY period: Enjoyed visiting relatives and catching up with family. Ate festive foods but kept portions small due to low appetite. Diet: Shared insights from dietitian on healthy swaps and reducing sugar and salt in cooking. Recent blood test: Slight improvement in cholesterol levels. Prescribed diabetes medication for elevated A1C. Initially upset but accepted it for long-term health. App usage: Did not watch videos due to a busy schedule. Doesn’t use reminders, relies on self-discipline after meals. HC feedback: Encouraged learning and affirmed their knowledge. Strength: Disciplined, motivated, eager to learn, and proactively manage health.",
    "number_of_goals": 3,
    "goals": [
      "Exercise daily for at least 1 hour",
      "Reduce portion sizes and adjust ingredients to healthier options",
      "Explore app features and share what is useful"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 70,
    "note": "1. Diet: Reduce consumption of carbohydrates, sugar, and salt in meals during the CNY festive period. Wellness vision: To live a longer happy life, eat what I want, sleep well, travel, and stay healthy. 3-month goals: 1. Reduce weight. 2. Lower cholesterol. Exercise: Maintains brisk walking routine and recently included morning sessions with exercise machines near home. Feels this helps with joint health. Diet: Reduced fatty foods and carbohydrates, uses substitutes like anlene powder instead of condensed milk, avoids added salt when cooking. Supported by family, especially spouse who encourages healthy meals. Finds smaller portions manageable though daily carb intake is still a challenge. Feels more energized and motivated due to integrating habits into their routine. Medication: Recently increased dose. Discussed benefits of adherence to prevent chronic illness and maintain health. App usage: Watched videos on diet, found them helpful. HC encouraged exploring other features for next session. Strength: Motivated, has started lifestyle changes on their own with strong family support. HC to explore how to maintain progress or increase intensity in future sessions.",
    "number_of_goals": 1,
    "goals": [
      "Reduce consumption of carbohydrates, sugar, and salt in meals during the CNY festive period"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 71,
    "note": "1. Diet: Reduce sugar intake in breakfast 5 times a week, by omitting condensed milk in coffee and tea and by reducing sugar in oats (7/10). 2. Diet: Reduce salt consumption by cooking more home meals, twice a week during weekends (confidence 6/10). 3. Diet: Cut daily carbohydrate intake by half. 4. App: Watch at least two educational videos and discuss with coach in the next session. Wellness vision: To live a longer happy life, eat what I want, sleep well, travel, and stay healthy. 3-month goals: 1. Reduce weight. 2. Lower cholesterol. Reasons for joining: Referred to study while seeking to reduce cholesterol. Health: Has high cholesterol, high blood sugar, and hypertension. On medication for cholesterol, hypertension, and kidney. Physical activity: Walks and stretches daily. Does housework. Walks grandchild to school and walks to the mall. Diet: Cooks for household with balanced meals—1 meat, 1 veg, 1 soup. Recently attended healthy eating talks. Medication: Generally adherent, may occasionally forget when meals are delayed. No issue with adjusting medication if needed. Social: Lives with spouse, cooks for extended family. Strengths: Proactive in learning healthy habits. Barriers: None identified. Future interest: Continue improving diet. Action item: Share app videos related to healthy eating.",
    "number_of_goals": 4,
    "goals": [
      "Reduce sugar intake in breakfast 5 times a week, by omitting condensed milk in coffee and tea and by reducing sugar in oats (7/10)",
      "Reduce salt consumption by cooking more home meals, twice a week during weekends (confidence 6/10)",
      "Cut daily carbohydrate intake by half",
      "Watch at least two educational videos and discuss with coach in the next session"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 72,
    "note": "2. I will not eat fried and processed food for 5 days a week. SMART goal adjusted from 7 to 5 days.",
    "number_of_goals": 1,
    "goals": [
      "I will not eat fried and processed food for 5 days a week"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 73,
    "note": "1. Jogging once a week, every Wednesday afternoon, for 30 minutes, at the jogging track near home (Confidence level: 8/10). Medical history: diabetes (poorly controlled), hypertension, hyperlipidaemia. Currently on medications for all three conditions. Surgical history: underwent a procedure for kidney stone removal a month ago. Medication review: generally adherent to medication with occasional misses when outside. Does not require reminders asclienthas established a routine. Prefers combining medications with lifestyle changes due to concerns about long-term side effects. Wellness vision: keep diabetes under control, engage in regular exercise to manage blood pressure and cholesterol, and adopt a healthier diet. Lifestyle review: recently started jogging and intends to maintain the habit. Diet is heavily carbohydrate-based (70% rice/noodles, 20% meat, 10% vegetables). Does not enjoy vegetables but is willing to increase intake to 20–25%. My Healthy Plate concept was introduced, but client found 50% vegetables difficult to implement.",
    "number_of_goals": 1,
    "goals": [
      "Jogging once a week, every Wednesday afternoon, for 30 minutes, at the jogging track near home (Confidence level: 8/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 74,
    "note": "1. Goal: Go for a 1-hour walk three times a week in the sun to support bone health. Client has osteoporosis and benefits from sunlight exposure.",
    "number_of_goals": 1,
    "goals": [
      "Go for a 1-hour walk three times a week in the sun to support bone health"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 75,
    "note": "1. Exercise: Incorporate 5–10 mins of cycling daily in the evening after returning home from work and before showering, 90% confidence. 2. Medication: Take statin medication daily after shower and before bed, 100% confidence. 3. Diet: Take photo of meals and log in the food diary two times a day, 7 days a week, 100% confidence. 4. Meditation: Meditate 10 mins daily, either in the morning or evening. Wellness vision: Not yet shared, but client would like to reduce cholesterol levels. 3-month goal: Bring cholesterol levels back to healthy range. Energy level: Low due to a busy past two weeks. Highlight of the month: Feeling healthy and enjoying home-cooked food. Goal review: (1) Meditation—started in past week, 10 mins daily, feels refreshed and it helps with sleep. 50% completion. (2) Exercise—does light stretches at work, part of routine. 70% completion. (3) Medication—now part of daily routine after shower and before bed. 100%. (4) Diet—takes food photos later, feels diet is healthy. 40%. Generative moment: Discussed sarcopenia and strategies for muscle maintenance, including strength training and protein sources like chickpeas, drumstick leaves, and cashews. Strength: Family support—partner exercises, household lives healthily, client is motivated. Future interest: Sarcopenia, reintegrating exercise into routine. Action item: Reflect on past 6 months and close session.",
    "number_of_goals": 4,
    "goals": [
      "Incorporate 5–10 mins of cycling daily in the evening after returning home from work and before showering, 90% confidence",
      "Take statin medication daily after shower and before bed, 100% confidence",
      "Take photo of meals and log in the food diary two times a day, 7 days a week, 100% confidence",
      "Meditate 10 mins daily, either in the morning or evening"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 76,
    "note": "1. Diet: Take photo of food on the app (95% confident). 2. Exercise (Self-initiated): Stretching exercises at work for 5 minutes every day, taking breaks in between. 3. Meditation: Meditate at night for 20 minutes before bed, when not working late. 4. Medication: Take statin every day and indicate on app (100% confidence level). Energy level was low due to a busy day and an afternoon eye appointment. Cholesterol results showed borderline high LDL of 3.8. Client felt uncertain about the cause, and HC explained possible factors like genetics, medication, and lifestyle. Encouraged discussion with healthcare providers. Stress from work has reduced, but cholesterol results are now a source of concern. Client prefers to maintain current diet, mostly home-cooked with minimal junk food. Medication routine is well established. Client uses a smart ring with reminders to move and track sleep. Sleeps 6–7 hours on weekdays, more on weekends, reports good quality. Meditation was self-initiated—has prior training and follows a guru, uses personal apps. Aims for 20 min in morning and night, currently more feasible at night unless working late. HC encouraged ongoing healthy habits and consulting healthcare team for cholesterol management. Action item: Continue food photo reminders on the app.",
    "number_of_goals": 4,
    "goals": [
      "Take photo of food on the app (95% confident)",
      "Stretching exercises at work for 5 minutes every day, taking breaks in between",
      "Meditate at night for 20 minutes before bed, when not working late",
      "Take statin every day and indicate on app (100% confidence level)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 77,
    "note": "1. Diet: Take photo of food on the app (50–60% confidence). 2. Medication: Take statin every day and indicate on app (90% confidence level). 3. Exercise (Self-initiated): Stretching exercises at the end of the day for flexibility for at least 10 minutes daily (50% confident). Wellness vision: Not yet shared, but client would like to reduce cholesterol levels. 3-month goal: Bring cholesterol levels back to a healthy range. Diet: More aware of food choices—reduced fried and processed foods, eating whole fruits and baked nuts instead of salted. Medication: Now a daily habit, taken without prompts. No longer relies on reminders from family. App usage: Watched videos and found them useful. Food diary increased awareness of diet. Health journal felt stressful—journaling not a preferred activity. Stress: Feels less stressed since choosing to prioritize health after turning 60. Values time with family. Exercise: Does evening stretches to improve flexibility and reduce lower back pain. 3-month goal review: Awaiting cholesterol test results, no changes to goals. HC feedback: Current pace and approach are working well. Insight: “I want to go from dependent to independent.” Action item: Follow up on cataract surgery, cholesterol results, exercise, and diet.",
    "number_of_goals": 3,
    "goals": [
      "Take photo of food on the app (50–60% confidence)",
      "Take statin every day and indicate on app (90% confidence level)",
      "Stretching exercises at the end of the day for flexibility for at least 10 minutes daily (50% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 78,
    "note": "1. Diet: Take photo of food on app (60% confidence). 2. Medication: Take statin every day and indicate on app (90% confidence). Wellness vision: Not yet shared, but client would like to reduce cholesterol levels. 3-month goal: Bring cholesterol levels back to healthy range. Diet: Eats mostly home-cooked meals. Chooses wholemeal bread for breakfast while family prefers white bread. Interested in learning whether current meals meet nutritional needs. Documenting intake: 30% completion due to work schedule. App reminders help with consistency. Medication: Taking medication more regularly (80% success). Supported by reminders from app, partner, and children. Occasionally forgets to log, not to take. Intends to build independence from app reminders over next two months.",
    "number_of_goals": 2,
    "goals": [
      "Take photo of food on app (60% confidence)",
      "Take statin every day and indicate on app (90% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 79,
    "note": "1. Diet: Take photo of food on app of at least one meal in a day (80% confidence level). 2. Medication: Take statin every day and document on app (60% confidence level). Wellness vision: Not yet shared, but client would like to reduce cholesterol levels. 3-month goal: Bring cholesterol levels back to healthy range. Reasons for joining: Curious about how to reduce cholesterol. Family: Holds a full-time job, three grown-up children. Cholesterol: Diagnosed with high cholesterol two years ago despite being lean and eating home-cooked meals. Acknowledged possible contributing factors like genetics and lifestyle. Previously took 10mg statin, now on 20mg. Has been inconsistent due to reliance on supplements like red yeast, pine bark, omega-3. Agreed to take statin daily during study period. Physical activity: Has a slipped disc, cannot jog but can brisk walk. Sedentary job. Stopped regular exercise 10 years ago. Diet: Follows mostly vegetarian diet aligned with religious practices. Avoids fried food, added sugar, and salt. Meals taken at irregular times due to work. Support: Partner reminds him to take medication, but limited interaction due to work. Strength: Satisfied with current life, making dietary adjustments with partner. Barriers: Busy schedule, may be in early contemplation stage for lifestyle changes. Future interest: Explore exercise, follow-up on diet tracking. Action item: Send notifications to remind client to log food photos.",
    "number_of_goals": 2,
    "goals": [
      "Take photo of food on app of at least one meal in a day (80% confidence level)",
      "Take statin every day and document on app (60% confidence level)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 80,
    "note": "1. Exercise: Do combined cardio (cycling) and weight training three times a week for at least half an hour (80% confident). 3-month follow-up: LDL cholesterol dropped from 3.6 to 2.8. Medication: No issues taking medication. Adjusted routine to mornings for better adherence. Goal review: 1. Exercise goal rated 7/10 due to occasional missed sessions from procrastination. Demonstrates strong self-awareness and strategies to overcome. 2. Continues with self-initiated keto diet. 3. Minimal weight loss, but client is content and believes consistency is key.",
    "number_of_goals": 1,
    "goals": [
      "Do combined cardio (cycling) and weight training three times a week for at least half an hour (80% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 81,
    "note": "1. To improve sleep duration by leaving their phone from 8pm in another room (90% confident). Client currently sleeps only 5 hours. Agreed to reduce afternoon naps to 20 minutes and avoid screen use after 8pm to support better sleep habits.",
    "number_of_goals": 1,
    "goals": [
      "improve sleep duration by leaving their phone from 8pm in another room (90% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 82,
    "note": "1. SMART GOAL: To take statin every morning and tick taken in the CADENCE D-PHA App (60% confident). Client has been very diligent with statin intake, reported no issues, and showed empty pill boxes as evidence.",
    "number_of_goals": 1,
    "goals": [
      "take statin every morning and tick taken in the CADENCE D-PHA App (60% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 83,
    "note": "1. SMART Goal: To take statins every morning together with three other medications (60% confident). Client takes four pills daily in the morning (two for blood pressure, one statin, one other) and will continue being regular with all medications, including statins.",
    "number_of_goals": 1,
    "goals": [
      "take statins every morning together with three other medications (60% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 84,
    "note": "1. Eat a healthy plate 5 times a week at lunchtime around 12. Client will cook at home and follow the healthy plate model (quarter protein, quarter whole grains, half vegetables).",
    "number_of_goals": 1,
    "goals": [
      "Eat a healthy plate 5 times a week at lunchtime around 12"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 85,
    "note": "2. Eat a healthy plate three times a week for lunch when cooking at home. Client was instructed on the healthy plate model: quarter rice or noodles, quarter protein, and half plate vegetables or fruit.",
    "number_of_goals": 1,
    "goals": [
      "Eat a healthy plate three times a week for lunch when cooking at home"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 86,
    "note": "(1) Exercise: Go 2–3 times to gym per week and run for at least 30 minutes each time (70% confidence). (2) Exercise: Use ab roller every day (20 reps × 5 sets) (90% confident). 3-month goal: Increase the frequency of exercise. Client removed previous goal of learning a new language. Exercise: Jogging 5km regularly, though not enjoyable, done for health. Prefers swimming but finds it inconvenient. Continues ab roller routine (100 reps daily), questioning whether to increase intensity. Diet: Eats oats daily but finds it difficult; not interested in using the food diary. Stress: Currently experiencing low stress, taking a break from work. Medication: LDL levels showed no improvement; statin dosage increased. Client is accepting of medication changes. App usage: Uses medication reminders but not keen to explore other app features. HC recommended trying educational videos.",
    "number_of_goals": 2,
    "goals": [
      "Go 2–3 times to gym per week and run for at least 30 minutes each time (70% confidence)",
      "Use ab roller every day (20 reps × 5 sets) (90% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 87,
    "note": "(1) Exercise: Go for a walk once a week for 2 hours (confidence level: 70%). 3-month goal: Increase the frequency of exercise (removed goal on learning a new language). Exercise: Client shared they had more time to exercise and incorporated the ab roller into daily routine while watching TV. Previously enjoyed swimming but finds the hassle and crowd a barrier. Social life: Hopes to reconnect socially when in better health—wants to catch up, eat, and drink with others. Diet: Follows a strict, restrictive diet and finds it unenjoyable. When asked about adding variety, expressed uncertainty and was encouraged to speak with a dietitian. Not interested in exploring dietary changes further. Medication: Taking medication regularly; described it as part of routine. App reminders are helpful. App usage: Uses app only for health coaching sessions and medication reminders; does not engage with other features due to other life priorities. Goal setting: Chose not to set new goals for now; prefers to try changes organically and share updates in the next session.",
    "number_of_goals": 1,
    "goals": [
      "Go for a walk once a week for 2 hours (confidence level: 70%)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 88,
    "note": "(1) Exercise: Jog 2–3 times every week for 30 minures (9/10 confident). (2) Self-Care: Learn Korean when having free time, either on weekends or 30 minutes a day depending on energy level. 3-month goals: (1) Increase the frequency of exercise. (2) Practice self-care by learning a new language (Korean). Information: Client recently resigned and plans to take a two-month break before starting a new job in January 2025. Has plans to travel to Spain for a holiday, looking forward to walking more and enjoying local cuisine without the burden of work. Self-care: Understood how self-care contributes to health after brief psychoeducation. Exercise: Recently resumed jogging after recovering from illness and is determined to maintain regular activity. Meditation: Tried gratitude meditation for the first time during the session; found it unfamiliar but acknowledged it as a new learning experience. Other: Encouraged to watch app videos and try self-reflection exercises.",
    "number_of_goals": 2,
    "goals": [
      "Jog 2–3 times every week for 30 minures (9/10 confident)",
      "Learn Korean when having free time, either on weekends or 30 minutes a day depending on energy level"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 89,
    "note": "(1) Exercise: Jog once per week and wear a knee guard (7/10 confidence). (2) Meditation: Do research on meditation by next session (80% confidence). Reasons for joining: Would like to find ways to reduce cholesterol as diet and exercise do not seem to be effective. Employment: Works in sales and travels frequently, at least twice a month. Living arrangement: Lives with a family member and a young child. Diet: Mostly eats out by buying takeaway for the household. Skips breakfast but selects healthier options such as ban mian or oatmeal. Does not enjoy the taste but chooses them for health reasons. Finds healthy eating even more difficult while travelling. Strengths: Discipline and willpower—able to maintain a healthy diet despite disliking it. Barriers: Difficulty finding healthy food when eating out, especially at coffee shops or while travelling. Erratic work schedule disrupts consistency in exercise. Experiences work-related stress. Future action: Would prefer more best practice suggestions from coach. Wellness vision: To eat a variety of foods that are enjoyable and be free from medication. 3-month goals: (1) Increase frequency of exercise. (2) Practice meditation to reduce stress.",
    "number_of_goals": 2,
    "goals": [
      "Jog once per week and wear a knee guard (7/10 confidence)",
      "Do research on meditation by next session (80% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 90,
    "note": "(1) Immediate: Go for blood test by next session (60% confident). (2) Exercise: Continue stretching exercise daily for 5 minutes in the evening before sleep (80% confident). Wellness vision: To live a healthy life and not burden loved ones. 3-month goals: (1) Exercise: Walk at least 5k steps a day. (2) Exercise: Explore workout classes on Healthy365. (3) Sleep: Sleep before 12am. (4) Medication: Take cholesterol medication regularly. (5) Balance screen time on phone with more rest. Notes: Energy level was lower due to recovery from overseas trip. Travel was relaxing but disrupted routines, increased food intake, and affected sleep schedule. Goal review 1: Wellbeing rated 3–4/10 as work flow reduced breaks. Only drank water when body signaled thirst. On successful days, used water bottle as visual reminder. Goal review 2: Personal goal rated 8–9/10—met friend weekly, learning Japanese and Hindi. Enjoys learning culture, engaging mind, and connecting globally. 3m goal review: Medication goal achieved; other goals not yet met. Added goal to rest eyes more due to screen time. Generative moment: Screen time mostly on Shopee and social media. Aware of its impact on hand, eyes, and inactivity. Uses phone for prayers, meditation, and work; hesitant to reduce usage. Strengths: Fear of being unhealthy, positive mindset, faith. Action items: Follow up on blood test results, learnings from ageing conference, and upcoming trip in June.",
    "number_of_goals": 2,
    "goals": [
      "Go for blood test by next session (60% confident)",
      "Continue stretching exercise daily for 5 minutes in the evening before sleep (80% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 91,
    "note": "1. Wellbeing: Take conscious breaks at work to stretch, drink water, and walk (60% confident). 2. Personal: Meet someone new once a month. Wellness vision: To live a healthy life and not burden loved ones. 3-month goals: 1. Walk at least 5k steps a day. 2. Explore workout classes on Healthy365. 3. Sleep before 12am. 4. Take cholesterol medication regularly. Energy level: Higher today as client is almost fully recovered. Past month spent partly recovering and partly easing back into walking. Recovery period: Followed strict diet with porridge and non-spicy foods, ate till 70% full, avoided festive snacks. Took more rest, less social interaction. Reflected that it was a sign to take a break. Diet: Indulged in snacks moderately. Enjoys foods like char kway teow, carrot cake, and spicy food. Typical meals: cereal with nuts and honey, noodles for lunch, rice and fruit for dinner. Work: Deskbound, mostly filing. Described needing time to \"warm up\" like a cold engine. Sleep: Sleeps around 10–11pm, wakes 6–7am. Goal review: Recovery—80%, due to discipline in diet, sleep, and hydration. Medication—90%, uses reminders and places pills visibly, but occasionally forgets to log in app. Generative moment: Inspired by idea of healthspan—remaining active, independent, and avoiding chronic illness. Motivated by observations at the polyclinic and desire to avoid being a burden. Interested in diet, sleep, exercise, and stress as components of healthy aging. App usage: Did not use app much, cited busy schedule. Feedback that reminders are mistimed—will be passed to developers. Next blood test scheduled for 07/04/2025. Strength: Resourceful and knowledge-seeking. ",
    "number_of_goals": 2,
    "goals": [
      "Take conscious breaks at work to stretch, drink water, and walk (60% confident)",
      "Meet someone new once a month"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 92,
    "note": "1. Medication: Take statins daily using reminders and by placing pills in view after seeing reminders (confidence: 70%). 2. Overall health: Focus on recovery. Wellness vision: To live a healthy life and not burden loved ones. 3-month goals: 1. Walk at least 5k steps a day. 2. Explore workout classes on Healthy365. 3. Sleep before 12am. 4. Take cholesterol medication regularly. Reasons for joining: Wants support to manage cholesterol better due to forgetfulness around medication. Notes: Lives with children and takes supplements for general health and anti-aging. Joined the study after visiting booths at the polyclinic. Sleep: Uses HPB-issued watch synced with Healthy365. Sleeps before midnight, averaging 6–7 hours. Strength: Motivated to improve health. Future area of interest: Deeper discussion on motivations and general health. Action item: Expand wellness vision and define monthly goals.",
    "number_of_goals": 2,
    "goals": [
      "Take statins daily using reminders and by placing pills in view after seeing reminders (confidence: 70%)",
      "Focus on recovery"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 93,
    "note": "1. Diet: More conscious and aware of food choices, limits indulgent foods like durian to smaller portions or special occasions. 2. Alcohol: Reduced alcohol intake to twice (only one glass) a month from nightly (80% confidence). 3. Medication: More regular with statin intake, with occasional missed night doses. 4. Exercise: Brisk walking for at least 45 minutes three times a week, adapts during rainy weather by using sheltered paths (6/10 confidence). Plans to include cycling and hiking in 2025. 5. Work: Aims to transition to part-time roles to support personal goals. 6. Personal goals for 2025: Quarterly travel to neighboring destinations, resume playing the ukulele, go hiking and cycling, play golf, and focus on improving quality of life. 7. Maintenance: Health habits are integrated into daily routine and viewed as essential for wellbeing. 8. App usage: Finds videos helpful and concise; tried gratitude journaling but found privacy to be a concern. Strength: Makes realistic plans, determined to follow through, aware of personal limits and capacities. Action item: Follow up on focus group discussions.",
    "number_of_goals": 4,
    "goals": [
      "More conscious and aware of food choices, limits indulgent foods like durian to smaller portions or special occasions",
      "Reduced alcohol intake to twice (only one glass) a month from nightly (80% confidence)",
      "More regular with statin intake, with occasional missed night doses",
      "Brisk walking for at least 45 minutes three times a week, adapts during rainy weather by using sheltered paths (6/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 94,
    "note": "(1) Diet: Take a photo of at least one meal and log daily on the app (7/10 confident). (2) Medication: Track usage on app and take daily statins in the morning (90% confident). (3) Exercise: Brisk walk every day for 30 minutes (confidence: 8/10). (4) Health Journal: Complete 1–2 entries in health journal before next session. (5) Alcohol: Minimize alcohol intake on weekdays.\r\nWellness vision: Same as before.\r\n3-month goals: (1) Reduce consumption of indulgent foods (e.g. durian, pork leg, kway chap, beer). (2) Experience satisfaction from eating healthily. (3) Consistently take medication (metformin and statin). (4) Incorporate meditation into routine.\r\nClient shared that progress is close to goal but still ongoing. Note:\r\nWork: Recently resigned from full-time job due to management issues, continues part-time.\r\nExercise: Maintains brisk walking. Interested in adding swimming and cycling in 2025. Used to swim long distances.\r\nAlcohol: Set goal to reduce weekday alcohol intake. Will be visiting a dry region in China in December, which may support this goal.\r\nMeditation: Attempted during walks but discontinued as it didn’t feel effective.\r\nDiet: Following intermittent fasting more consistently and eats healthy on weekdays. Cooks for family on weekends.\r\nFamily: Spouse joins walks and intermittent fasting. Plans to travel more together in 2025.\r\nSleep: Improved after job stress was removed. Noted better mental wellbeing.\r\nTravel: Plans to visit Boston to spend time with family. December travel to Malaysia and Pakistan for two weeks.\r\nStrengths: Determination—quit smoking for child. Planner—sets goals in different life domains to stay aligned.\r\nAction item: Wrap up and review plans for 2025.",
    "number_of_goals": 5,
    "goals": [
      "Take a photo of at least one meal and log daily on the app (7/10 confident)",
      "Track usage on app and take daily statins in the morning (90% confident)",
      "Brisk walk every day for 30 minutes (confidence: 8/10)",
      "Complete 1–2 entries in health journal before next session",
      "Minimize alcohol intake on weekdays"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 95,
    "note": "Energy level: 70% during midday. Blood test: Cholesterol levels were well managed, but glucose and albumin levels were not within the desired range. Medication: Attributed elevated glucose to a recent prescription that increased urination but didn’t seem effective. Felt that healthcare providers didn’t fully understand personal routines. Concerned about long-term kidney health due to diabetes and medication use. Continues regular intake of statins and hypertension medication. Diet: Identified carbohydrates as a major contributor to glucose levels and has started halving rice portions. Believes cutting back on oily foods has supported cholesterol control. Health coaching review: Found the approach more conversational and reflective compared to interactions with doctors, nurses, and pharmacists. Felt comfortable to express thoughts and increased self-awareness. While no major changes were reported, felt stable and not worsening. App review: Shared that AI tools are useful for health-related queries, offering empathy, voice support, and simple explanations. Found coaching interaction the most helpful feature, along with medication reminders. Did not enjoy journaling features and felt video content could be made simpler. Technical issues such as being logged out or buggy chats were noted as potential deterrents. Upcoming travel: Plans to visit Greece and South Korea for leisure and aims to maintain current health habits during the trips.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 96,
    "note": "Did not set weekly goals and would like to maintain status quo. Wellness vision remains the same: to live longer to see children and grandchildren thrive, to be healthy enough to provide guidance, and not be a burden. No new 3-month goal was set. Was unwell for 2 weeks and took another week to recover. Feels more susceptible to illness with age, noting lethargy and brain fog as symptoms. Discussed prevention measures like mask wearing but finds them impractical; views illness as somewhat inevitable. Expressed skepticism about chronic illness prevention and holds the belief that the body self-regulates dietary intake. Discussed diets and noted that many people around follow trends that are not sustainable. Emphasized that health is important primarily to support family. Avoids smoking and drinking, and manages diet with this intention. Recently shifted mindset to take on fewer projects at work to reduce stress and protect health. Expressed desire to pursue hobbies, reading, and visiting new places but feels these are only feasible after retirement due to work demands. Has not yet initiated workload reduction. Recognized that work stress may be contributing to frequent illness and delayed recovery. Declined to set new goals when asked, and expressed a belief in fate regarding health outcomes. Future interests include discussions on longevity and preparing for the final session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 97,
    "note": "Did not set weekly goals and prefers to maintain the status quo. Wellness vision remains: to live longer to witness children and grandchildren thrive, provide advice when needed, and avoid being a burden. No new 3-month goal was set. Cholesterol levels were within range in the recent test, though glucose levels were slightly elevated. Medication intake remains consistent, supported by a pill box. There is a strong belief that medication is the primary means to maintain health. No preference for physical activity was expressed due to concerns about injury. Diet is mainly home-cooked, with meals spaced out to manage glucose. At the office, economic rice is the usual option with controlled portion sizes. In-depth discussion on the advantages and challenges of working from home highlighted blurred work-life boundaries and emotional strain, such as dealing with difficult emails. Despite this, appreciates the flexibility, improved diet, and reduced commuting stress that WFH allows. Currently at a career plateau and looking forward to retirement. Stress management was discussed; watching videos is the main leisure activity mentioned. Potential to revisit this topic in future sessions. Client acknowledged being satisfied with current routines and does not feel a need to set new health goals at this time. App feedback included concerns about unappealing visuals, slow startup, and disengaging video content. Suggested improvements include making the gratitude journal more interactive through MCQs and updating the health coach’s photo and bio. Future areas to explore include sleep quality and identifying self-care strategies to support stress management.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 98,
    "note": "Did not set weekly goals and prefers to maintain status quo. Wellness vision remains unchanged. No 3-month goal was set. In reflecting on 2024, shared appreciation for not falling ill much aside from two bouts of COVID-19, and hopes to stay healthy in 2025. Highlighted the importance of avoiding new chronic illnesses and discussed reasons for this, including the benefits of staying healthy. In mental health discussions, asked about the meaning of life in older age. Initially framed it as hypothetical but later shared that this may reflect a personal transition and a search for meaning, which the client associates with family. Expressed interest in retirement but feels it is not the right time yet. Health coach shared examples of meaning in later life, including predictors of quality of life such as social support and engaging activities. Client also questioned whether life is meant to be happy or sad. Discussion included the concept of perception versus objective events and explored examples of resilience. Currently not keen to pursue health adjustments, possibly due to work fatigue; mentioned desire to rest and watch Netflix after retirement. At the end of the session, HC reiterated the flexible nature of the sessions and encouraged the client to share areas of interest to explore further. Strengths include strong family focus and curiosity in discussing meaningful topics. Future areas of interest: exploring diabetes-friendly diet and continuing mental health discussions. Action item: HC to ask more about client’s lived experience with dietary changes for diabetes management.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 99,
    "note": "Did not set weekly goals and prefers to maintain status quo. Wellness vision remains unchanged. No 3-month goal was set. The session aimed to check in on goals and explore areas of health and wellbeing. Client emphasized the importance of preventing chronic illness, particularly concerned about kidney health due to potential medication effects. Actively reads up on health indicators and takes steps to reduce salt intake. For stress management, has intentionally slowed down at work, setting boundaries by declining new projects. Rates work stress at 4–5/10 and sees it as necessary for productivity. Previously served as a wellness ambassador and expressed continued interest in stress management; coach shared additional videos and resources. Client shared that supporting and guiding children is a main source of motivation. Regarding the app, finds the interface unappealing and prefers not to use it. Does not enjoy writing, so gratitude journals are not a good fit. Watched two educational videos but felt they contained too much text and medical terminology; would prefer simple, actionable content. When asked about other health topics, appeared to be in the pre-contemplation phase—open to information but not ready to make changes. Strengths include curiosity for learning and strong family motivation. Future interest: stress management. Action item: ask about general health during the next session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 100,
    "note": "Take statins daily in the morning. Wellness vision: To be able to live longer to see children and grandchildren thrive and do better. Being healthy allows the ability to offer guidance and not be a burden. 3-month goal: Take medication daily. Reasons for joining: To learn more about the app and explore potential use at work. Health background: Diagnosed with diabetes, cholesterol, and hypertension at 50. Currently on regular medication and adheres strictly using a pillbox and morning routine. Confident and accepting of the role of medication in managing health. Physical activity: Not active due to environmental concerns such as pollution and finds no personal need to exercise. Diet: Not restrictive but avoids excessive intake of high-cholesterol foods. Lifestyle: Shows curiosity in stress management, though overall appears to be in the precontemplation stage for broader behavior changes. App usage: Informed about features and their evidence base, but not currently motivated to explore them. Strengths: High adherence to medication and acceptance of condition. Barriers: Primary interest is in understanding the app rather than improving personal health. Future interest: Stress management. Action item: Share stress management resources and check on medication adherence next session.",
    "number_of_goals": 1,
    "goals": [
      "Take statins daily in the morning"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 101,
    "note": "Additional notes: Client is very knowledgeable about nutrition and regularly cooks for the household. Highly motivated to eat healthily, including baking their own bread as part of a balanced diet.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 102,
    "note": "Eat one healthy plate for dinner (mixed rice, vegetables, chicken) 2 to 3 times a week (8/10 confidence). Client plans to achieve this by intentionally choosing balanced meals during dinner on selected days of the week.",
    "number_of_goals": 1,
    "goals": [
      "Eat one healthy plate for dinner (mixed rice, vegetables, chicken) 2 to 3 times a week (8/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 103,
    "note": "Diet: Cut down on oil by 50% in home-cooked meals (partner prepares) every dinner (60% confidence). Wellness vision: Absence of illness, good mental health, and financial stability to support work, daily functioning, travel, and mobility. 3-month goal 1: Continue being active through jogging. 3-month goal 2: Lose weight together with partner. Reasons for joining: Contribute to research. Health: History of cardiac event, currently on multiple medications including aspirin. Cholesterol medication is taken every other day due to concerns about liver side effects. Has an established routine of taking medication every morning. Lives with partner and two children. Works in a technical role at a manufacturing firm. Jogging on weekends and occasionally on weekdays. Missed some sessions recently due to volunteering commitments. Vegetarian due to health and spiritual beliefs. Meals include fried vegetables, tofu, eggs, and soy-based products. Looking to reduce processed food and oil. Finds it challenging to eat healthily outside but works with partner to improve lifestyle. Invests in tools to support health, finds purpose in activities like gardening and DIY repairs. Regularly volunteers at a spiritual organization. Will be going overseas for a family visit. Values include financial responsibility, being present for loved ones, and having a helpful attitude.",
    "number_of_goals": 1,
    "goals": [
      "Cut down on oil by 50% in home-cooked meals (partner prepares) every dinner (60% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 104,
    "note": "Goal: Take statins every night at 11pm (60% confidence level). Client has not taken statins regularly after logging out of the app. Will resume taking statins.",
    "number_of_goals": 1,
    "goals": [
      "Take statins every night at 11pm (60% confidence level)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 105,
    "note": "2 Goal: Take statins every night at 12am (90% confident). Client shared that cholesterol levels have improved through health coaching and expressed satisfaction with the progress.",
    "number_of_goals": 1,
    "goals": [
      "Take statins every night at 12am (90% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 106,
    "note": "SMART goal: Take statins every night around 11pm and log as taken in the D-PHA app (70% confidence level). Client is adherent to statins. Initially experienced tiredness from statin use, which subsided after one month. Currently taking energy supplements to maintain energy levels. Intends to discuss reducing statin dosage with doctor. Previously took red yeast rice supplements but agreed to stop after finishing current supply due to recent reports of liver toxicity. Coach observation: client appears motivated, in good spirits, and less tired.",
    "number_of_goals": 1,
    "goals": [
      "Take statins every night around 11pm and log as taken in the D-PHA app (70% confidence level)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 107,
    "note": "1. Take statins every night at 11pm and log it in the app (60% confident). Client would like to reduce the statin dose. HC advised to consult a GP, as only the doctor can adjust the statin dosage.",
    "number_of_goals": 1,
    "goals": [
      "Take statins every night at 11pm and log it in the app (60% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 108,
    "note": "1. Take statin every night at 12am and set medication reminder in the app (confidence: 60%). Client is taking 20mg of statin and is reluctant due to concerns about kidney damage. Intends to reduce medication intake.",
    "number_of_goals": 1,
    "goals": [
      "Take statin every night at 12am and set medication reminder in the app (confidence: 60%)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 109,
    "note": "1. Take statin medication daily (60% confident). HC discussion: Enquire about sleep routine observations Wellness vision: To be able to take care of self, not have alzheimers, reduce digestive symptoms to 20–30 minutes a day, make appointments with friends, live simply, and not die at home 3-month goals: 1. Reduce cholesterol 2. Reduce blood sugar 3. Reduce digestive symptoms Reasons for joining: Has been trying many approaches to manage digestive symptoms, exploring whether health coaching may support symptom relief Health: Experiencing digestive issues for 5 years, previously consulted multiple hospitals but discontinued due to unpredictable symptoms and stress from scheduling appointments, currently using lower-cost TCM that doesn’t require bookings, episodes last 1–1.5h, occasionally skip days but often return more severely Medication: Concerned about statin side effects, not currently taking metformin but aware of elevated sugar levels Diet: Meals include mixed rice with leafy vegetables, bread with nuts, eggs, sardines, olive oil, previously vegan but adjusted diet due to digestive triggers Exercise: Active 5x weekly at a nearby active ageing centre, includes strength training, aerobic games, and stretching Sleep: Experiences difficulty falling asleep at night, naps during the day, explored winding-down strategies with HC Stress: Reports low perceived stress overall, though digestive issues restrict social life Social: Lives alone. Strength: Persistent and adaptive, willing to try different approaches and responsive to guidance Barrier: May rely on overly rigid routines that add pressure; beginning to consider more flexible strategies Future interest: Explore non-diet contributors to digestive symptoms and assess how consistently health routines are practiced Action item: Encourage follow-up with a doctor for symptom discussion and assess potential for psychological support",
    "number_of_goals": 1,
    "goals": [
      "Take statin medication daily (60% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 110,
    "note": "Missed session. HC reached out to CRC who shared that client has digestive issues and could not attend. HC followed up in chat to reschedule.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 111,
    "note": "Wellness vision: To be physically active, have a positive mindset so that I can do things I enjoy such as walking, playing games. By being healthy, I can care for my spouse and spend time with friends. 3-month goals: (1) Prevent getting osteoporosis (2) Protect and preserve my knee",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 112,
    "note": "Did not want to set weekly goals but expressed interest in getting a wearable or device to monitor blood glucose levels. HC asked client to explore the app and share what features and videos are useful 3-month goal: Reduce blood sugar levels. Energy level was high. Highlight of the month: no changes to health, no sickness or pain, feeling grateful for smooth days Goal check-in was adapted as client expressed satisfaction with current lifestyle and felt that committing to change would cause stress Current health-supportive activities: (1) Work brings joy—provides income, social interaction, flexibility, and sense of purpose (2) Diet—avoids fried food and sugar, prefers zero sugar carbonated drinks, prepares home-cooked meals using steaming methods, avoids buffets with friends Generative moment: curious about continuous glucose monitoring devices, worried about scams, interested in low-cost options, believes body gives early signs of high glucose (e.g. itching) which the client currently does not experience Exercise: does not currently exercise, previously swam with sister 10 years ago, did not feel difference then Mental health: enjoys going to the movies alone as a form of self-care Medication: improved from 70% to 90% adherence by using meal times as a reminder, occasionally unsure if medication was taken—follow up next session Goal setting: not ready to set new goals, prefers low-pressure framing of health activities Strengths: resilient, knowledgeable, joyful Future areas of interest: glucose monitoring Action plan: HC to research local glucose monitoring devices, follow up on client’s own findings, focus on affirming healthy behaviors and exploring potential improvements, revisit wellness vision when ready.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 113,
    "note": "No goals set yet. Wellness vision: TBD. 3-month goal: Reduce blood sugar levels. Reasons for joining: Cash remuneration from the study. Medical history: High cholesterol, high blood pressure, and elevated blood glucose since the 40s. Currently takes prescribed medication regularly in the morning. Occasionally misses the cholesterol pill when skipping dinner, as medication is taken with meals. Diet: Aims to maintain a low-sugar diet but recently became more aware that staples like rice, bread, and biscuits also contribute to glucose levels. Enjoys Chinese desserts and occasionally eats durian. Describes being disciplined and familiar with dietary guidelines, having followed various diets over a lifetime. Family: Single parent with two grown children, rarely in contact—sees them around twice a year. Expressed a desire for more frequent connection after having raised them independently. Parent lived to 92 and adopted a healthy lifestyle from age 65. Social support: Has 2–3 close friends, prefers not to expand the circle due to discomfort with unsolicited advice. Lives alone in a studio apartment, occasionally visited by befrienders but uninterested in community events. Work: Part-time driver, enjoys the flexibility. Free time: Watches TV, YouTube, plays mobile games—notes that this affects eye health. Strengths: Independence, strong knowledge of nutrition and exercise. Future area of interest: Co-develop a health action plan. Action item: Send exercise and nutrition video content via app notifications.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 114,
    "note": "No personal goals set yet. HC requests that client continue exploring the app and share experience in the next session. Wellness vision: Not to fall sick easily, stay positive, and eat healthily. Being healthy to see my daughter excel in life. 3-month goal: Do more exercise. 3-month goal: Reduce weight from 70kg to 60kg and lower BMI. Reasons for joining: Was approached by CRC and was curious to know what the study was about. Health condition: High cholesterol, hypertension, and stent in 2015. Longstanding psoriasis since the 1990s (hereditary) and arthritis. Family: Has a teenage daughter and provides caregiving support for a toddler grandniece. Regularly shares meals with three siblings. Mindset: Maintains a positive outlook on life, inspired by others who are coping with more serious challenges. Aims to focus on joy rather than illness. Medication: Generally adherent to morning medications. Occasionally forgets evening cholesterol medication. Has entered medications into the app to assist with tracking. Exercise: Wishes to lose weight but has not begun exercising. Saves workout videos from Instagram and YouTube and may start when ready. Daily caregiving requires physical activity. Diet: Eats smaller portions and feels full quickly when dining with siblings. Strength: Positive mindset and outlook on health. Action items: Follow up on effectiveness of medication reminder feature. Explore saved exercise videos and motivations behind saving them.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 115,
    "note": "Missed session due to work. Client was on day shift and requested to reschedule.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 116,
    "note": "Missed session. Client did not accept the session on the app for the third time and was unresponsive via the chat function. Multiple notifications were sent prior to the session requesting acceptance.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 117,
    "note": "2. Weekly goal check-in: (1) Check in on SMART goal – Statins: How is the statin medication routine going? Reminder to take statins every night. (2) Review progress on any other weekly goals discussed previously.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 118,
    "note": "2. Goal to eat healthy 5 times a week, choosing non-fried dishes for lunch (90% confident). Client prepares healthy meals, includes many vegetables, and stays physically active throughout the day.",
    "number_of_goals": 1,
    "goals": [
      "eat healthy 5 times a week, choosing non-fried dishes for lunch (90% confident)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 119,
    "note": "Missed session",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 120,
    "note": "Missed session. Client did not attend. HC has reached out to reschedule.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 121,
    "note": "(1) Self-care: Plan travel to Europe, discuss finances with a sibling. (2) Walking together with a parent and a friend for 30 min at least 3 times a week (80% confidence). (3) Prioritize rest: Look into eldercare home and social worker's support for mental health break, or arrange for a live-in helper. Wellness vision: Good health to me is to look good, have a good physique and good mental health. With good health and a strong heart, I would like to find a partner and travel overseas. 3-month goals: (1) Improve mine and my parent’s health so that we can go overseas. (2) Improve my mental wellbeing. Started the session with low energy levels, and on probing is due to the lack of sleep from caregiving duties. Was also experiencing grief related to a recent loss in the family. When asked what was remembered about the family member – shared that they cared deeply for others despite being quiet. Exercise: Due to the parent’s deteriorating condition, was not able to exercise much as sleep was disrupted. Goes on brisk walks with the parent and a close friend when possible. Diet: Tries to eat healthily, supported by family and extended relatives who also prefer simple meals. Also encourages friends to eat healthily. Social support: Coping by chatting regularly with friends through messaging apps – including old activity groups and breakfast companions. Self-care: Watches TikTok and YouTube videos to unwind. In this session, HC focused on affirming current efforts and discussed rest and self-care strategies. Strength: Strong support from friends and family. Barriers: Care responsibilities for a parent are currently impacting personal health. Area of interest/action item: Check-in about house repairs and emotional wellbeing in the next session.",
    "number_of_goals": 3,
    "goals": [
      "Plan travel to Europe, discuss finances with a sibling",
      "Walking together with a parent and a friend for 30 min at least 3 times a week (80% confidence)",
      "Look into eldercare home and social worker's support for mental health break, or arrange for a live-in helper"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 122,
    "note": "Missed session. Followed up with client in chat function.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 123,
    "note": "Not yet decided – client shared not ready to set goals. Wellness vision and 3-month goals not set yet: client expressed no current intention to define goals. Information: Age: Late 50s to early 60s. Family: Lives with spouse and two adult children (one married, one working). Diet: Eats simply—bread and pau in the morning, skips lunch, and cooks dinner with pork, fish, and vegetables but eats little meat. Enjoys western food occasionally when bought by family members. On cruises, tends to overeat and drink. Hobbies: Enjoys travelling frequently with friends—visits include various European countries, Southeast Asia, and cruises. Also enjoys drinking socially. Alcohol intake: Drinks 1–3 bottles of beer, 4–5 times a week, with friends and family, and does not wish to cut down. Sleep: Sleeps only 2–3 hours daily, sometimes goes without sleep for two days. Exercise: Aware of need to exercise but lacks motivation. Describes physical activity as walking in malls or doing chores like gardening. Goes out occasionally with a sibling to walk or shop. Medication adherence: Often forgets medication when travelling. Strengths: Generally happy, enjoys each day, finds satisfaction in life. Active personality—dislikes being idle. Sibling could be a potential support for increasing activity. Barriers: Social environment supports drinking habits. Action item: No goals set this round—can check again next session. Also check comfort level with recording, as this session was not recorded at client’s request.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 124,
    "note": "Missed session. Client missed session after rescheduling.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 125,
    "note": "Missed session. Client missed session despite multiple notifications and reminders.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 126,
    "note": "Could not define goals. Client did not join the call. Contacted CRC, who reached out but received no response.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 127,
    "note": "Wellness vision: To be able to travel around the world, especially to learn about culture and ancestry. To have mobility and avoid medication during travels. 3-month goal: Has personal goals set. Energy level was low due to mother’s recent hospital admission, which also led to falling ill and feeling fatigued. Plans to restart momentum in April after recovery. Goal review: (1) Initial chest pain believed to be muscle strain, now resolved. (2) Diet—due to hospital duties, eating out more and finds it hard to include fruits. Chooses economic rice and soup-based meals over fried food. (3) Medication—generally adherent, with occasional missed doses when busy at hospital. Has medication at work and nearby. Generative moment: Discussed self-care during stressful periods—prepares meals and watches comedies to stay optimistic and grounded. Reflected on all six sessions—initially viewed them as a chore but grew to find value in having someone to share with. Learnt the importance of focusing on health, identified optimism as a personal strength, and acknowledged the need to prioritize rather than multitask. App usage: Took time to learn, found medication reminders most useful. Health coaching helped with stress relief through shared conversations. Feedback: Suggested app improvements such as incentives and in-person gatherings to foster connection. Future direction: Would like to move step by step—resume exercise, care for self as a caregiver, and stay aware of physical limits.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 128,
    "note": "1. Take statins every day between 8 and 9 am and log it in the app (50% confidence). Client travels frequently to China and often forgets to take statins while away.",
    "number_of_goals": 1,
    "goals": [
      "Take statins every day between 8 and 9 am and log it in the app (50% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 129,
    "note": "Exercise: Has been regularly doing taichi, with the exception of a short break during a recent birthday. Also continues stretching and watching exercise-related videos. Support: Meets with a close group of friends each month and enjoys these gatherings. Family: Sons and three grandchildren visit regularly, and time spent with spouse is appreciated. Diet: During the session, reflected that preventing gout is a top priority, as past episodes were painful. Blood pressure: Shared that blood pressure readings remain high and wonders if age may be a factor. Was advised to monitor and consult a doctor. Confirmed that the BP machine has been calibrated. Fall prevention: Shared past experiences with falls but feels confident about current safety practices. App usage: Watched videos on myocardial infarction and stroke, found them informative. While interested in exercise content, prefers watching on other apps. App feedback: Described using the app as a learning journey and suggested simplifying its features. Icons during calls were not intuitive, possibly due to age. Found the cheat sheet helpful and noted that in-person workshops could be useful, depending on availability. Concluded with gratitude and well wishes.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 130,
    "note": "No goals decided yet. Will follow up in the next session with a review of past six conversations. Exercise: Continues taichi and walking, finds that staying active reduces aches and pains. Novelty: Enjoys exploration and discussed visiting places in Singapore such as Clementi, and local churches. Social life: Prefers quiet family time and small gatherings over large social events. Meaningful time: Values peaceful moments at home and time with family, shared that living each day meaningfully is important. Blood test: Results were satisfactory, though not familiar with the exact values. Medication: Takes cholesterol medication regularly. Skips blood pressure medication due to concerns over low readings (BP ranges from 99 to 155). Plans to continue monitoring BP regularly. Learning: Expressed interest in taking photography classes but concerned about assessments. App usage: Viewed resources on HDL and LDL, interested in empathy topics but faced accessibility issues. Will check with CRC on next visit. Strengths: Tenacity and interest in lifelong learning. Barriers: Some difficulty navigating technology. Future interests: Continued learning and exploring new places in Singapore. Action item: Review past sessions, gather feedback on app experience, and discuss next steps.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 131,
    "note": "Not yet decided – client shared not ready to set goals. Wellness vision: Not explicitly stated, but values mental acuity and functional mobility at older age. 3-month goal: Not yet decided. Explored educational videos on the app but does not wish to explore further. Exercise: Practices qigong regularly. Cognitive: Stopped playing MJ game due to update. Recently bought a new computer but is facing setup issues. Interested in a mobile photography class, to pursue after spouse recovers. Social: Spouse is currently injured and requires care. Keeps in touch with friends via WhatsApp and occasional meetups. Medication: Taken consistently as part of daily routine. Psychological: Uses acceptance and reframing to manage current stressors. Practices gratitude and finds support through religious faith. Motivation: Feels stable and coping well; no specific area identified for further focus at the moment. Follow-up: Continue exploring wellbeing and risk/protective factors in absence of goals.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 132,
    "note": "(1) Explore the CADENCE D-PHA app such as medication reminder by ussing it every day (confidence level 8/10). Wellness vision: Not explicitly stated, but values mental sharpness and physical independence in older age. 3-month goal: Not yet decided. General focus on becoming familiar with the CADENCE D-PHA app. Medication: Regular with statin and amlodipine. Exercise: Walks the dog daily and practices qigong on Mondays. Diet: Eats home-cooked meals prepared by spouse; opts for takeaway when needed. Cognitive: Plays a matching tile game on the phone, currently at level 20. Social: Mentioned spouse recently sustained a walking-related injury; to follow up in future sessions. Other: Recently downsized from a larger residence to an HDB unit; content with the space and kept renovations minimal. Also discussed frustrations with technology and long waiting times at service counters.",
    "number_of_goals": 1,
    "goals": [
      "Explore the CADENCE D-PHA app such as medication reminder by ussing it every day (confidence level 8/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 133,
    "note": "Not yet decided – client shared not being ready to set goals. Wellness vision: Not explicitly stated, but values mental sharpness and physical mobility in older age. 3-month goal: Not yet decided. Reasons for joining: Referred by doctor and nurse due to fluctuating cholesterol levels; interested in improving this. Exercise: Walks regularly and recently enrolled in a taichi class. Previously had a knee issue but recovered mobility through consistent physiotherapy and exercise. Medication: Taking blood pressure medication, simvastatin, vitamin D and B12. Mental health: Feels at peace and adopts a relaxed approach to life. Family: Caring for a spouse undergoing dialysis; maintains a strong relationship with spouse and has one adult children. Social: Has monthly gatherings with friends and keeps in touch via messaging apps. Outlook: Content with current stage of life but wishes to avoid cognitive decline like mother. Strengths: Demonstrates persistence in recovery from physical injury and has strong personal discipline with daily routines.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 134,
    "note": "Missed session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 135,
    "note": "(1) Eat a variety of food in small portions every day for lunch (30% confidence) (2) HC recommendation: Explore educational content on the app by watching at least 2 videos until next meeting. Wellness vision: Not explicitly stated due to language barrier, but shared wanting to stay healthy to continue travelling and exploring the world. 3-month goals: (1) Keep fit (2) Eat healthy. Reasons for joining: Referred by doctors and wanted to try something new. Background: Retired. Occasionally takes on part-time packing jobs. Enjoys dancing, travelling, and cleaning. Diet: Eats a wide variety of food without restriction to maintain enjoyment. Exercise: Minimal formal exercise but maintains activity through regular housework; can walk for long durations without fatigue. Language: Speaks basic English with some Mandarin, requiring simplified conversation. Strengths: Open to new experiences, perseverant, supported by caring children. Barriers: Technology and language made the session challenging. Future areas of interest: Healthy eating. Action item: Share relevant dietary videos and prepare simplified questions for future sessions.",
    "number_of_goals": 2,
    "goals": [
      "Eat a variety of food in small portions every day for lunch (30% confidence)",
      "Explore educational content on the app by watching at least 2 videos until next meeting"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 136,
    "note": "Missed session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 137,
    "note": "Missed session. Client missed session after rescheduling.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 138,
    "note": "Missed session. Will contact client again.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 139,
    "note": "Exercise, Diet, Medication. Lives with family and has four children, three of whom are working adults and one still in school.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 140,
    "note": "Missed session. HC reached out via chat to reschedule; awaiting response.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 141,
    "note": "1. Take Atorvastatin every evening after dinner (100% confidence). Will bring medication along when going out, including to karaoke.",
    "number_of_goals": 1,
    "goals": [
      "Take Atorvastatin every evening after dinner (100% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 142,
    "note": "2. Take statins every night at 11pm (7/10 confidence). Occasionally skips dose when experiencing headache or muscle spasm.",
    "number_of_goals": 1,
    "goals": [
      "Take statins every night at 11pm (7/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 143,
    "note": "Missed session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 144,
    "note": "Missed session. Client did not attend. HC followed up via chat to reschedule.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 145,
    "note": "1. Exercise daily for 30 minutes (confidence level 8/10), (2) consume at least one vegetable (such as lettuce) every day for lunch (6/10 confidence), and (3) take statins consistently everyday at 8 pm (7/10 confidence). Client reported regular exercise. Cholesterol values showed improvement at the last visit.",
    "number_of_goals": 3,
    "goals": [
      "Exercise daily for 30 minutes (confidence level 8/10)",
      "consume at least one vegetable (such as lettuce) every day for lunch (6/10 confidence)",
      "take statins consistently everyday at 8 pm (7/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 146,
    "note": "2. Improve diet and eat healthier by including a healthy plate every day (CONFIDENCE 8/10). Client showed cookies and processed sweets bought for CNY and expressed intent to resume daily healthy plate after the holiday. The goal is to avoid eating the cookies entirely.",
    "number_of_goals": 1,
    "goals": [
      "Improve diet and eat healthier by including a healthy plate every day (CONFIDENCE 8/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 147,
    "note": "2. Do physical activity every day in the form of brisk walking or tai chi five times a week for at least 30 minutes (80% confidence). Client shared that it may be difficult during the New Year due to visiting brother and increased cooking. Will try to walk with brother daily as much as possible.",
    "number_of_goals": 1,
    "goals": [
      "Do physical activity every day in the form of brisk walking or tai chi five times a week for at least 30 minutes (80% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 148,
    "note": "Three-month goal: Lower cholesterol levels and lose some weight. Client expressed a desire to lose weight.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 149,
    "note": "General observation: Client appears content and in good spirits. Enjoys chanting, gardening, and doing Sudoku in the evening. Reported losing a few pounds around the abdomen since the last health coaching meeting.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 150,
    "note": "2. SMART Goal: To do Qi Gong exercises online five times a week (5/10 confidence). Client's son purchased an online program, and the client plans to do the exercises either at home or in the garden.",
    "number_of_goals": 1,
    "goals": [
      "do Qi Gong exercises online five times a week (5/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 151,
    "note": "1. SMART GOAL: To take statin every morning and tick taken in the CADENCE D-PHA App (9/10 confidence level). Client will bring a pouch with extra statin tablets when visiting their child for a week, as this is when statins are usually forgotten.",
    "number_of_goals": 1,
    "goals": [
      "take statin every morning and tick taken in the CADENCE D-PHA App (9/10 confidence level)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 152,
    "note": "Final session. At the request of the client, the session was short and focused on summarizing past experience and suggestions for improvement. Client reflects a desire to reduce cholesterol levels and medication intake and had hoped for an intervention with immediate results. Suggests that health coaching sessions could be more directive and structured. Finds the educational materials useful but did not access them, stating they felt like “common sense” and expressing a general preference for not using the phone frequently. Describes managing diet and exercise in a strict way and felt demoralized when cholesterol levels did not improve. HC reflected that small changes were still observed, such as greater variety in diet. Client shared that “resistance is futile” and accepts the need for long-term medication. HC affirmed that lifestyle may be helping prevent further worsening despite lack of measurable improvement. Client reported bugs in the app: receiving multiple medication reminders one hour after the original, and not receiving notifications while overseas even though login was possible. HC closed the session with well wishes and encouragement to continue prioritizing health.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 153,
    "note": "None set. Client began the session by asking if it could be the final one. When HC inquired further, the client shared that they saw no progress or change from the sessions. When asked for feedback, the client expressed that health is a personal responsibility and they prefer not to share personal matters, attributing it to personality rather than discomfort. HC acknowledged and empathized with the client's perspective. The conversation shifted to an upcoming trip, and the client shared intentions to incorporate walking or jogging while traveling. HC discussed possible nature destinations for walking. Reviewed previous topics such as exercise and dietary habits—client noted improved variety in breakfast, and HC shared information about glycemic index and substitution strategies for dinner. HealthHub resources were shared after the session. On stress, the client acknowledged some improvement since the first session but noted it may change if financial concerns arise. The client emphasized preferring jobs that support wellbeing over those that cause stress. The session closed with encouragement and appreciation, and HC explained that they would follow up with the research team to confirm if the program could conclude at the fifth session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 154,
    "note": "(1) Diet: Control diet for pre-dawn meal by eating a balanced diet every day (2) Medication: Take statin medication every day with the help of reminders (8/10 confidence). Wellness vision: Good health means enjoying life, being mobile, having strong support, being free of health problems, and being able to socialise with friends. 3-month goals: (1) Reduce body weight/lower BMI (2) Engage in more exercise and social activities. Reasons for joining: Recommended by doctor and recruited by CRC. Medical history: High cholesterol (4.0 in recent test), attributed to diet. Medication: No resistance to taking medication, but often forgets due to alternating-day prescription. Has set personal phone reminders to help. Family: Lives with spouse and a live-in helper. Full-time caregiver to spouse with stroke for over 10 years, currently bedridden and often hospitalised for infections. Maintains close ties with family in China and has a supportive relationship with daughter-in-law. Exercise: Recently began aerobic and chair exercises from a nearby organisation. Motivated to keep fit to prevent similar outcomes as spouse. Exercises when caregiving duties allow. Diet: Aware of healthy eating principles from past consultations but consumes gifted snacks to avoid waste. Free time: Prefers staying home to monitor spouse.",
    "number_of_goals": 2,
    "goals": [
      "Control diet for pre-dawn meal by eating a balanced diet every day",
      "Take statin medication every day with the help of reminders (8/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 155,
    "note": "1. Complete 4 times of exercise per week, each time lasting 35 minutes (30 minutes of aerobic + 5 minutes of resistance) (8/10 confidence level). Recently received blood test results showing significant improvement (LDL-C at 2.1 mmol/L). In discussion with pharmacist about reducing atorvastatin dose from 20 mg to 10 mg. Goals review: 1. Exercise goal: Completed at least 120 minutes of physical activity per week, and 170 minutes on some weeks. Identified 30 minutes of aerobic activity as upper limit due to light-headedness and fatigue. Cautioned not to over-strain and to stay within limits. Reported improved sleep quality and duration (from 4–5 to 6–8 hours). 2. Diet goal: Maintained consistent diet, but reported increased intake of comfort foods (ice-cream, chocolate) as a reward for LDL-C reduction. Gained weight. Encouraged to explore healthier alternatives such as dark chocolate with no added sugar or low-calorie options. Medication: No regular challenges with adherence, except while travelling. Occasionally used statins from spouse with same dose. One incident of double-dosing due to forgetfulness. Open to strategies such as using a pillbox and pairing medication with app logging.",
    "number_of_goals": 1,
    "goals": [
      "Complete 4 times of exercise per week, each time lasting 35 minutes (30 minutes of aerobic + 5 minutes of resistance) (8/10 confidence level)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 156,
    "note": "1. Exercise: Have daily 60-minute sessions combining alternate walking and short runs (90% confidence). 2. Incorporate weightlifting with dumbbells 2–3 times a week 20 repetitions (100% confidence). Complained of inner thigh muscle pain when sitting cross-legged and was advised to raise this with HCP at next clinic visit. 2. Diet: Adheres to MyHealthy Plate guidelines but recently added more food variety. Follows a self-initiated intermittent fasting schedule with meals between 11am–7pm. Breakfast typically includes two eggs and coffee with added coconut oil (5g), butter (7g), and olive oil (3g). Advised to reduce coconut and butter oil due to impact on lipid levels. Agreed to try reducing. 3. Medication: Consistently takes statin daily and logs in the app, with only one missed log in the past month.",
    "number_of_goals": 2,
    "goals": [
      "Have daily 60-minute sessions combining alternate walking and short runs (90% confidence)",
      "Incorporate weightlifting with dumbbells 2–3 times a week 20 repetitions (100% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 157,
    "note": "1. Diet: Limit the intake of unhealthy oily supper to twice a week (e.g. roti prata, curry fish head). Confidence: 6/10. 2. Exercise: Two times of brisk walking per week, each lasting 30 minutes (7/10 confidence). Wellness vision: To be more physically fit in the coming years or return to the fitness level achieved 10 years ago. Lifestyle review: Swims once a week (approximately 10 laps or 30 minutes) and goes for walks once or twice a week. Frequently consumes oily supper foods 3–4 times per week. Medication: Currently on statins for high cholesterol. Takes half a tablet on alternate days (3–4 times per week). Although believes in the efficacy of statins, prefers not to rely solely on medication and is combining it with lifestyle changes. Other info: Not currently employed and undergoing a mid-career switch. Previously worked as a building and facility manager. Action item: Learn more about maximizing the use of smartwatches (e.g. Healthy365) to track physiological metrics.",
    "number_of_goals": 2,
    "goals": [
      "Limit the intake of unhealthy oily supper to twice a week (e.g. roti prata, curry fish head). Confidence: 6/10",
      "Two times of brisk walking per week, each lasting 30 minutes (7/10 confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 158,
    "note": "(1) Diet: Order 2 vegetables and less meat every dinner during working week (60% confidence). (2) Diet: Snacks—take fruits (two servings) during tea time every day in a week (grapes and orange) (80% confidence). (4) HC set: Document food in food diary if found helpful. Wellness vision: To do things independently, not be a burden to others, to travel, and be free from injury. 3-month goal: Lose weight from 69kg to 65kg. 3-month goal: Able to jog 5km, up from 2km. Occupation: Retiree for 2 years. Family: Has 2 adult children. Health: History of knee surgery for torn ACL but currently physically active. Experiences breathlessness but not attributed to a specific condition after multiple tests. Medication: Regular with statins (missed 2 months previously due to administrative error). Takes omega-3 daily for brain and heart protection. Physical activity: Very active—plays squash, and participates in other sports regularly. Diet: Main concern. Enjoys local hawker food, finds it difficult to eat healthily outside. Cannot go without flour-based foods. Considering changes like swapping eggs for cabbage and taking oats with cereal. Recently started eating oats and cereal. Motivation: Wants to eat healthier due to concerns about cardiovascular risk and friends experiencing MI despite being active. Strengths: Actively seeks health knowledge, maintains a high activity level. Areas of interest: Diet, nutrition. Action plan: Share resources on My Healthy Plate and healthy hawker food choices.",
    "number_of_goals": 2,
    "goals": [
      "Order 2 vegetables and less meat every dinner during working week (60% confidence)",
      "take fruits (two servings) during tea time every day in a week (grapes and orange) (80% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 159,
    "note": "Energy level was low due to a busy week processing shipment. Experienced a back injury two weeks ago, which affected exercise plans. Highlight/gratitude: Despite the injury, remained fit and healthy, did not fall sick, and continued with hip strengthening exercises. Goal review: 85% for exercise goal due to consistent hip strengthening exercises. Goal review: Low progress on food photo uploads due to work commitments. Goal review: 100% medication adherence as it has become part of the daily routine. Medical report update: LDL within range at 3.1; expressed aspiration to lower it further and attributed success to meditation and exercise. Strengths and support: Cited personal motivation, structured routine, and family support as key enablers. Reported weight loss and shared that personal changes over the past 6 months have been positive.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 160,
    "note": "(1) Exercise: Exercising every day for at least 1.5 hours (75% confident). (2) Diet: Reduce portion size for all meals, adjust ingredients to healthier options for each meal, and incorporate vegetables and fruits into home-cooked meals at least 2 times a week. Wellness vision: To live a long, happy life, be able to eat freely, sleep well, travel, and avoid illness. 3-month goals: (1) Reduce weight (2) Reduce cholesterol levels (3) Reduce blood sugar. Energy level was low due to returning from an exercise session that included brisk walking and aerobic activity. While relaxing and beneficial, it also caused fatigue. Highlight: Felt well throughout the month, did not fall sick, and was grateful to maintain routines like housework and exercise. Goal review 1: Rated 7–8/10 for exercise. Exercised regularly, often for more than an hour. Reported feeling lighter, less clumsy, improved sleep, and appreciated the mental distraction and fresh air. Goal review 2: Rated 9–10/10 for diet. Reduced salt, sugar, fatty food, and increased vegetable intake, especially at dinner. Cut down on white bread and included more oats and fruit for breakfast. Goal review 3: Used the app to learn about exercise and diet. Generative moment: Reflected on healthy eating habits. Asked about food labels, such as cheese. Shared that healthier choice logos are now more recognized, even by family members. Brainstormed improvements for home cooking, including tofu, fish, and healthier oils like canola or sunflower. Follows a habit of eating until 85% full, aligned with a cultural saying about moderation. Strength: Highly motivated, in the action/maintenance stage of change. Interested in learning, previously borrowed health-related books and now uses the app's videos. Action plan: Follow up on upcoming blood test. Since in maintenance, identify long-term supports and strengths. Plan for overall review in the final session.",
    "number_of_goals": 2,
    "goals": [
      "Exercising every day for at least 1.5 hours (75% confident)",
      "Reduce portion size for all meals, adjust ingredients to healthier options for each meal, and incorporate vegetables and fruits into home-cooked meals at least 2 times a week"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 161,
    "note": "Wellness Vision: To feel fresh and active, and have energy to travel the world. To minimize doctor visits and not be a burden to children in older age. 3-month goal (1): To be more active. 3-month goal (2): Relax the mind from work. Energy level was good. Highlight of the month: Was able to exercise regularly, felt refreshed despite feeling tired at times. Goal review 1: Exercise (Weights) – 7/10, completed once a week instead of the intended 3 times. Goal review 2: Exercise (Walking) – 10/10, walked on weekdays for 30–45 minutes, used stairs during rainy days. Goal review 3: Swimming – swims on Saturdays. Goal review 4: Diet (Fasting) – 9/10, fasts on Mondays and Thursdays, paused only when helping prepare meals for family hosting. Goal review 5: Diet (Small portions) – determined to eat smaller portions, even when cooking; rarely eats out. Goal review 6: Medication – 10/10, consistently adheres to daily medication. Reflection: Feels more active and believes the 3-month goals were achieved. Strengths identified for maintaining health include willpower, effective scheduling, and a strong sense of personal responsibility. Expressed gratitude to the health coach for the support and encouragement in goal-setting and routine planning. App usage: Found the educational videos empowering, appreciated the reminders for exercise and medication adherence. Closed the session with gratitude and noted that while the coaching journey ends here, the personal health journey continues.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 162,
    "note": "(1) Diet: Have bread (with cheese, vegetables, spreads, or bacon) for dinner instead of a heavy dinner every day in a week (50% confidence). (2) Exercise: Go for bowling on Monday afternoons with friends for 1 hour. (3) Exercise: Walk 3km on Wednesday evenings in the HDB park nearby. Wellness vision: To have no major illness so that the family does not suffer and to enjoy quality time together, where quality living means peace in the family. 3-month goal: Gradual weight reduction from 75kg to 70kg. Energy level was 6/10 due to adjusting to a new work schedule, having just started work less than five days ago. Highlight of the month: Swapped out heavy dinners with bread, began walking once a week, and resumed bowling weekly. Transitioning from full-time employment to semi-retirement, currently clearing leave. Work: In a state of transition between break mode and partial commitment to work. Generative moment: Recognizes the benefits of semi-retirement such as reconnecting with friends, spending more time with family, and reduced stress levels. Goal review 1: Bread-for-dinner goal is more manageable on a two-week on/two-week off basis. 6/10. Goal review 2: Enjoys bowling at senior rates with friends on Monday afternoons. 10/10. Goal review 3: Started walking after the New Year; limits to 3km to accommodate physical health condition. App usage: Did not find features interesting or useful. Suggested adding a blood pressure monitoring log. Readiness: Feels that coaching sessions helped maintain accountability. Currently in the action phase for both diet and exercise. Action plan: Ask about recent trip, review the past six months, express gratitude for the time shared, and explore sustainability of lifestyle changes.",
    "number_of_goals": 3,
    "goals": [
      "Have bread (with cheese, vegetables, spreads, or bacon) for dinner instead of a heavy dinner every day in a week (50% confidence)",
      "Go for bowling on Monday afternoons with friends for 1 hour",
      "Walk 3km on Wednesday evenings in the HDB park nearby"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 163,
    "note": "(1) Exercise: Walk for 20 minutes, 3–4 times per week at 9 am (8/10). (2) Eat healthily: Eat more vegetables such as carrots and cabbage for up to 50% of plate, reduce meats to 25% of plate (60% confidence). Wellness vision: Did not explicitly state a vision due to language barriers, but shared a desire to stay healthy to continue travelling and exploring the world. 3-month goals: (1) Keep fit (2) Eat healthy (3) Drink more water. Energy level: Quite happy. Highlight of the month: Maintained the ability to eat, run, sleep, and enjoy preferred activities. Recent trip: Returned from India. Enjoyed the food, which the client found similar to Singapore cuisine but with less oil and spice. Successfully climbed a mountain with breaks, supported by friends in a group of around 20. Enjoyed the scenery, cool weather, and cultural experiences. Goal review 1: Stretching twice a week, walking one hour 2–3 times weekly, and started dancing. Found the activities effective and uses them to structure their free schedule. Goal review 2: Healthy eating—cooked and baked healthier foods such as chiffon cake, raisin bread, and vegetable pancakes with less oil and sugar. Increased vegetable intake through pickled cabbage and soups with chicken, fish, and tofu. Recent blood test showed increased cholesterol and weight gain to 78kg. Doctor suggested increasing medication dose, but the client preferred to first try lifestyle changes. Area of interest: Currently in the action stage—motivated to manage cholesterol through lifestyle. Action plan: Share food videos and My Healthy Plate resources. Follow up next session on diet and exercise routines.",
    "number_of_goals": 2,
    "goals": [
      "Walk for 20 minutes, 3–4 times per week at 9 am (8/10)",
      "Eat more vegetables such as carrots and cabbage for up to 50% of plate, reduce meats to 25% of plate (60% confidence)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 164,
    "note": "Missed session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 165,
    "note": "(1) Exercise: Start brisk walking on Monday, Wednesday, Friday by walking at 06:30am for at least 15–20 minutes around the neighborhood (Confidence level: 8/10) (2) Diet: Switch from white rice to brown rice and change cooking oil to sunflower oil or other healthier options three days a week. Wellness vision: To feel good, remain independent, continue doing the things I enjoy, travel, and not rely on others. 3-month goals: (1) Reduce cholesterol levels (2) Reduce weight from 78kg to 74–73kg (3) Reduce intake of oily food. Energy levels were low due to a recent flu vaccination and caregiving duties. Highlight of the month: Although tired and aching from carrying a spouse, feels grateful for being busy, healthy, and happy. Goal review – Medication: Now takes medication daily without needing reminders; it has become a habit. Goal review – Diet: Experienced some inconsistency during the fasting month with increased meat and reduced vegetables. During the festive period, managed snack intake well by replacing sugary drinks with water and limiting to one snack per visit. Goal review – Exercise: Started wall push-ups from videos, doing them twice weekly for 15 minutes. Interested in starting brisk walking again. Generative moment: Reflected on COVID-19 period as a time of health and happiness due to daily walks and time spent outdoors. Explored possible contributors to cholesterol levels including sleep, diet, and activity. Strength: Currently in action phase; actively making changes. Area of interest: Diet and cooking methods. Action plan: Share nutrition videos and healthy cooking resources.",
    "number_of_goals": 2,
    "goals": [
      "Start brisk walking on Monday, Wednesday, Friday by walking at 06:30am for at least 15–20 minutes around the neighborhood (Confidence level: 8/10)",
      "Switch from white rice to brown rice and change cooking oil to sunflower oil or other healthier options three days a week"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 166,
    "note": "(1) Exercise: Start muscle strengthening exercises daily (e.g. leg lifts and planks) for 45 minutes, 60% confidence. (2) Diet: Opt for healthier snacks such as nuts instead of potato chips at least 4 out of 5 times when walking past stores, 60%. Wellness vision: Free of new chronic illness, manage weight, remain independent, and maintain physical health to enjoy meaningful activities. 3-month goal: Lose weight from 72kg to 70kg. Lives alone, close to family, and frequently visits parents on weekends. Has two siblings (one of whom passed away young, influencing health perspective). Leads a mostly sedentary lifestyle but has travel plans to Japan in the coming months. Previously followed a strict “anti-cancer” diet but has since stopped. Currently consumes sweets, cake, and snacks such as chips and walnuts, contributing to recent weight gain. Expressed that “healthy food is not tasty” based on past diet program experiences. Participates in pickleball, preferring a specific community group that plays on Sunday afternoons. Tried using the app’s food diary but prefers another app for calorie tracking. Strengths include existing knowledge of nutrition and exercise, and available time as a retiree. Currently in the preparation stage of behavior change. Action plan: Build on past success from the COVID-19 period where weight loss was achieved through diet; next session to explore intrinsic motivation for sustainable health behaviors.",
    "number_of_goals": 2,
    "goals": [
      "Start muscle strengthening exercises daily (e.g. leg lifts and planks) for 45 minutes, 60% confidence",
      "Opt for healthier snacks such as nuts instead of potato chips at least 4 out of 5 times when walking past stores, 60%."
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 167,
    "note": "(1) Respite care: Take Friday–Sunday to unwind by arranging for sibling to care for parent during the weekend to rest and spend time with friends. Energy level was very low due to parent’s recent hospitalization after a fall. Sleep was disrupted from staying at the hospital, where the parent exhibited agitation. Highlight of the month: Difficult to identify positives due to caregiving stress. Currently overwhelmed by caregiving responsibilities. Goal review: Asked sibling to step in for weekend caregiving support to allow for respite, although this caused conflict—sibling prefers that care be provided only by familiar family members. Health update: Experienced chest tightness and breathlessness and was diagnosed with hypertension by a nearby private GP. Symptoms have since resolved and were likely related to stress. Past goals: House ceiling was repaired, and cleanup was completed due to the circumstances. Shared that the most pressing need is rest, but finds it nearly impossible. When asked what advice would be given to someone in a similar situation, emphasized the importance of staying calm. Conversation included reflection on the need to set personal boundaries to sustain caregiving. Action plan: Follow up on rest, wrap up the final session with a focus on self-care and recovery.",
    "number_of_goals": 1,
    "goals": [
      "Take Friday–Sunday to unwind by arranging for sibling to care for parent during the weekend to rest and spend time with friends"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 168,
    "note": "Missed session. Called client before the session to check if support was needed to make an appointment but there was no response. Two reminders were sent prior to the session.",
    "number_of_goals": 0,
    "goals": [],
    "goal_details": []
  },
  {
    "ID": 169,
    "note": "(1) Diet: Prepare balanced and simple home cooked meals for self and family at least 1–2 times a week, 8/10 confidence (2) App features: Watch videos on exercise and diet. Wellness vision: Not to fall sick easily, stay positive, and eat healthily. Being healthy to see daughter excel in life. 3-month goal: Do more exercise. 3-month goal: Reduce weight from 75kg to 68kg, lower BMI. Energy level was low due to flu and feeling unwell. Highlight of the month: Went for blood test recently and saw a reduction in cholesterol and blood glucose levels, attributed to regular medication, adjusted diet, and maintaining a positive mindset. Goal review 1: Food diary not used—forgot as phone was not nearby during meals. Goal review 2: Exercise was 1–2 times a week but paused due to illness; did joint exercises from Instagram which helped improve mood. Goal review 3: Cooked healthier meals by reducing salt, using ingredients like onion and garlic for flavor, and adding more vegetables. App usage: Did not use the app, though interested in videos on diet and exercise. Appears to be in pre-contemplation phase—shared that living each day at a time and spending time with niece brings joy and meaning. Action plan: Share nutrition and exercise videos. Check in again on health interests.",
    "number_of_goals": 2,
    "goals": [
      "Prepare balanced and simple home cooked meals for self and family at least 1–2 times a week, 8/10 confidence",
      "Watch videos on exercise and diet"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 170,
    "note": "(1) Declutter house (2) Keep fit by doing exercise twice a week, 30 minutes each (7/10) (3) Sleep early by 11pm and wake up early by 7am every day, 6/10 confidence. Wellness vision: To be able to take care of self, not have Alzheimer's, reduce IBS symptoms to 20–30 minutes a day, make appointments with friends, live simply, and not die at home. 3-month goals: (1) Reduce cholesterol (2) Reduce blood sugar (3) Reduce IBS symptoms. Highlight of the week: Attending TCM regularly on Saturdays as it is walk-in based and less stressful. Medication: Taking medication with meals daily but expressed concern that medication and meat may contribute to cognitive decline. Nutrition: Asked whether a vegan diet increases cholesterol—HC to follow up. Activity: Daily attendance at the activity centre, using hydraulic machines for 15 minutes to prevent sarcopenia and falls. Sleep: Currently struggles to sleep between 11pm–2am despite early fatigue at 9pm; attributes this to circadian rhythm. In the past, stress from work contributed to poor sleep. Schedule: Feels their schedule is hectic and that IBS limits social and personal plans. Identified strengths: Acceptance, gratitude, and supportive living environment. Goal setting was brief due to time constraints. Future areas of interest: Gut health, sleep schedule, supplements. Action plan: Narrow focus to sleep, IBS, or stress management. HC to follow up on vegan diet and cholesterol, and consumer-grade cholesterol monitoring tools.",
    "number_of_goals": 3,
    "goals": [
      "Declutter house",
      "Keep fit by doing exercise twice a week, 30 minutes each (7/10)",
      "Sleep early by 11pm and wake up early by 7am every day, 6/10 confidence"
    ],
    "goal_details": [
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  },
  {
    "ID": 171,
    "note": "(1) Get more than 8 hours of sleep on weekdays by sleeping by 12:30am and saying no to friends for online gaming by giving them an early heads-up (70% confidence) (2) Medication: Take statin medications daily (3) Diet: Be mindful of having a healthy relationship with food by not deliberately avoiding food, being reasonable with self, and allowing balance on “off” days Wellness vision: 3-month goals: Maintain cholesterol levels at 3, ideally reducing to 2.5; develop a healthy relationship with food and avoid controlling or restrictive behaviors Energy level was high due to being away from the office; other days are more tiring due to workload during the GE period Highlight of the month: Cholesterol levels reduced to 3.0 Goal review – Medication: 9/10, now an automatic habit Goal review – Diet: 10/10, reduced portion sizes and found balance with sugary drinks 3-month goal – Cholesterol: Met target; attributed progress to medication adherence and discipline Previous weight loss goal: Dropped in favor of developing a balanced relationship with food Exercise: Recently stopped due to busy schedule Generative moment: Reflected on sleep – though sleeping 7.5 hours, still feels unrested; gaming helps manage stress but is a tradeoff with better sleep; identified benefits of better sleep as improved mood and mental clarity Strengths: Self-motivated, strong self-awareness, and intentional habit formation; demonstrates a shift in mindset, framing unhealthy food as something to balance, not restrict, helping reduce guilt and increase autonomy Action plan: Continue maintenance for medication and diet; follow up on sleep and re-engaging with exercise",
    "number_of_goals": 3,
    "goals": [
      "Get more than 8 hours of sleep on weekdays by sleeping by 12:30am and saying no to friends for online gaming by giving them an early heads-up (70% confidence)",
      "Take statin medications daily",
      "Be mindful of having a healthy relationship with food by not deliberately avoiding food, being reasonable with self, and allowing balance on “off” days"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      },
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 0,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 172,
    "note": "(1) Exercise: Walk 5 times a week, each time lasting 30 minutes (2) App usage: Watch educational videos. Energy level was okay, no major highlights Goal review – Exercise: 5/10; managed 3–4 walks a week due to inertia from staying home; walks after sending child to school Goal review – Diet: 6/10; ate a variety of food during China trip in small portions; at home, reduces carbohydrates and eats more vegetables Generative moment: None identified; main focus is weight loss through diet, improved sleep, and regular exercise App usage: Found food diary unhelpful, uses medication reminders but does not log intake; has not started on educational videos but plans to 3-month goal review: Weight remains unchanged Action plan: Maintain current behavior changes; not ready to increase efforts; continue follow-up on videos and share additional nutrition resources",
    "number_of_goals": 2,
    "goals": [
      "Walk 5 times a week, each time lasting 30 minutes",
      "Watch educational videos"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 0
      },
      {
        "Specific": 1,
        "Measurable": 0,
        "Attainable": 0
      }
    ]
  },
  {
    "ID": 173,
    "note": "(1) Watch at least two app videos every week (confidence 7/10) Wellness vision: Good health means being able to eat and do what I want without needing to go to the hospital 3-month goals: (1) Bring cholesterol to healthy range (2) Maintain weight between 65–66 kg (3) Eat healthily Reasons for joining: Interested in the study and contributing to science. Health: High cholesterol, hypertension. Undergoing routine ultrasounds and monitoring by a doctor. Medication: Takes medication daily; sometimes forgets while overseas. Takes hypertension medication on alternate days as advised by doctor. Healthcare relationship: Regular GP, recently referred to polyclinic as GP may retire Exercise: Walks regularly, targets at least 5,000 steps daily, often walks during lunch Diet: Cooks at home, reduces carbohydrates, inquired about health impact of rice preparation methods (pressure cooker vs rice cooker; GI of refrigerated rice) Family: Lives with spouse and a child. Strength: Self-motivated in researching health topics, good engagement with healthcare professionals Areas of interest: In preparation phase for diet change. Shows curiosity but some resistance. Open to HC recommendations. Action plan: Assign videos on CMS, follow up on client dietary questions, and check what changes the client might be willing to try. Refine goals into specific SMART goals if appropriate.",
    "number_of_goals": 1,
    "goals": [
      "Watch at least two app videos every week (confidence 7/10)"
    ],
    "goal_details": [
      {
        "Specific": 1,
        "Measurable": 1,
        "Attainable": 1
      }
    ]
  }
]